banben2="1.0.6";

function QDSign(ａ︉︉︆︆, ａ︉︉︉︉︉︉, ａ︍︍︍︍︍) {
  let ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็ = "jl4SGVlycyuedu486atdsApds7695oe0dfj23wncgxzdDg56SAFH2b3571ahGdsFzh";
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ = this.java.base64Decode("bGVuZ3Ro") + [];
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀ = this[this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("c291cmNl")][this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("a2V5")]["r" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + "l" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 45] + "ll"]("[ -:‏-︁" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 48] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + "n]", []) + [];
  let ａ︁ = this["P" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + "ck" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]] + [];
  let ａ︁︁ = this[ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︁[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6]] + [];
  let ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็ = this[ａ︁[7] + ａ︁[2] + ａ︁[7] + "h" + ａ︁︁[4]] + [];
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็;
  let ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[ａ︁︁[20] + ａ︁︁[1] + "U" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]();
  [ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็, ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] = [][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]][ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + (ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ + {})[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 57] + ａ︁[2] + ａ︁[3] + ａ︁[2] + "+" + ａ︁[0] + ａ︁[13] + "," + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + "()" + ａ︁[13])(this);
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂ = this[ａ︁[1].toLowerCase() + ａ︁[2] + ａ︁[3] + ａ︁[2]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "x" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5]](ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็) + [];
  let ａ︉︆︆︆︆︆ = [][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]][ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31], ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁[12] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[33 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁[0] + ａ︁[13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁[12] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[12] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁[12] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁[0] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + decodeURIComponent("%" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19]) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + "{" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁[12] + ａ︁[7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 2) + ａ︁[7] + ａ︁︁[33 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁[12] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁[18 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁[18 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + "{" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁[12] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + "A" + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁[12] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ">" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + "&&" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + "<" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁[12] + ａ︁[7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[12] + ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ">" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + "xFFFF" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁[18 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[12] + ａ︁[7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁[7] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁[12] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁[7] + ">" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁[12] + "{" + ａ︁[7] + ａ︁︁[27] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁[7] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁[7] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁[7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + "}}" + ａ︁[7] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 5 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + "&&" + ａ︁[7] + ａ︁︁[27] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁[7] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + "}" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁[7] + ａ︁︁[27] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5));
  let ａ︊︊︊︊︊︊︊︊︊︊ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[2]];
  let ａ︆︆︆︆︆︆︆︆ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45];
  let ａ︇︈︆︆ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁[20] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + "q" + ａ︁︁[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13];
  if (ａ︍︍︍︍︍) {
    return ａ︉︆︆︆︆︆([this, ａ︍︍︍︍︍, "f86054df2268ce8d"]);
  }
  let ａ︇︉︆ = [][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]][ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31], ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + "z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5));
  let ａ︉︇︆︆︆︆ = [][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]][ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31], ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45], ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁[13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁[13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︁[0] + ａ︁[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[12] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[2] + ａ︁[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︁[13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 557 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 3 + 0) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 786 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 2) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 1099 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 0 + 0) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 993 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 4 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 634 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 1003 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 4 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁[20] + "<" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︁[7] + ａ︁︁[27] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + "T" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁[13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 2) + ａ︁︁[20] + "-" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5));
  let ａ︈︇︆︆︆︆︆ = ａ︇︉︆([this, ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]);
  if (!ａ︈︇︆︆︆︆︆) {
    this[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + "z" + ａ︁[7]]();
    ａ︈︇︆︆︆︆︆ = ａ︇︉︆([this, ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31]]);
  }
  let [ａ︇︇︆︆︆︆︆︆︆︆, ａ︉︆︆︆, ａ︉︉︅︅, ａ︇︅] = ａ︈︇︆︆︆︆︆.split(ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 2));
  let ａ︇︇︆︆︆︆︆︆ = {};
  [ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + "U" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + "U" + ａ︁︁[0], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁[27] + ａ︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0], ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0], ａ︁[3] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[2] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20], ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + "x" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "B" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20], ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2), ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁[2] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14]](ａ︈︇︅︅︅︅︅︅︅︅ => {
    ａ︇︇︆︆︆︆︆︆[ａ︈︇︅︅︅︅︅︅︅︅] = this[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]][ａ︈︇︅︅︅︅︅︅︅︅];
  });
  let ａ︎︎︎︎︎︎︎︎ = this[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︁[7] + ａ︁︁[33 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]][ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5]]["T" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]];
  ａ︇︇︆︆︆︆︆︆ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[2]][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0]](this[ａ︁[1] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[1] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[26]][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︇︇︆︆︆︆︆︆)[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁[2] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](this[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + "x" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]](ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + "*" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 5)), ""));
  let ａ︈︆ = ａ︉︉︉︉︉︉.sort().join("&");
  let ａ︇︆︆ = ａ︉︇︆︆︆︆([this, ａ︇︇︆︆︆︆︆︆, ａ︉︇︆︆︆︆, ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]]);
  let ａ︉︇︆ = "{" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + "Y" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + "q" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[21 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + "Kq" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁[7] + ａ︁[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁[13] + ａ︁︁[27] + ａ︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14];
  let ａ︆︆︆︆ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[77 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9];
  let ａ︈︈︈︈︈︈ = "Rv1rPTnczce|" + ａ︇︆︆ + "|" + ａ︆︆︆︆︆︆︆︆ + "|" + ａ︇︅ + "||||" + ａ︊︊︊︊︊︊︊︊︊︊[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︈︆.toLowerCase()) + "|f189adc92b816b3e9da29ea304d4a7e4";
  let ａ︈︆︆︆︆︆︆︆︆︆ = ａ︊︊︊︊︊︊︊︊︊︊[ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1]](ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︉︇︆, ａ︆︆︆︆)[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[20] + "B" + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5]](ａ︈︈︈︈︈︈);
  let ａ︉︅︅︅︅︅︅︅︅ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[37 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "AA" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + "B" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[77 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "AA" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7];
  let ａ︈︈︈︈︈︈︈︈︈ = ａ︊︊︊︊︊︊︊︊︊︊[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]("AAAAAAAAAAA" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1));
  let ａ︆︆︆︆︆ = ａ︇︅ + "|7.9.394|1080|1184|1000009|10|1|" + ａ︉︆︆︆ + "|1526|1000009|4|" + ａ︆︆︆︆︆︆︆︆ + "|" + ａ︇︆︆ + "|1|" + ａ︇︅ + "|||||0";
  let ａ︅︅︅︅︅︅︅︅︅︅ = ａ︊︊︊︊︊︊︊︊︊︊[ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + "B" + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︆︆︆︆︆, ａ︉︅︅︅︅︅︅︅︅, ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19], ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︈︈︈︈︈︈︈︈︈);
  let ａ︇︈︅︅︅︅︅︅︅ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁[2] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁[2] + ａ︁[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁[7] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9];
  let ａ︇︉︆︆︆︆︆︆︆︆ = {
    QDSign: ａ︈︆︆︆︆︆︆︆︆︆,
    QDInfo: ａ︅︅︅︅︅︅︅︅︅︅,
    tstamp: ａ︇︆︆,
    "User-Agent": "Mozilla/mobile QDReaderAndroid/7.9.394/1526/1000009/" + ａ︉︉︅︅
  };
  while (!ａ︎︎︎︎︎︎︎︎) {
    ａ︊︊︊︊︊︊︊︊︊︊.toast("书源验证失败" + []);
    ａ︎︎︎︎︎︎︎︎(200);
  }
  if (/booksearch\/searchbooks|bookcontent\/getvipcontent/.test(ａ︉︉︆︆)) {
    return ａ︇︈︆︆ + "/argus/api/" + ａ︉︉︆︆ + "," + JSON.stringify({
      method: "POST",
      body: ａ︈︆,
      headers: ａ︇︉︆︆︆︆︆︆︆︆
    });
  } else {
    return ａ︇︈︆︆ + "/argus/api/" + ａ︉︉︆︆ + "?" + ａ︈︆ + "," + JSON.stringify({
      headers: ａ︇︉︆︆︆︆︆︆︆︆
    });
  }
}
function ZWjj(ａ︉︈︆︆︆︆︆︆︆︆, ａ︅︅︅︅︅︅︅, ａ︇︇︅︅︅) {
  let ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็ = "jl4SGVlycyuedu486atdsApds7695oe0dfj23wncgxzdDg56SAFH2b3571ahGdsFzh";
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ = this.java.base64Decode("bGVuZ3Ro") + [];
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀ = this[this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("c291cmNl")][this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("a2V5")]["r" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + "l" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 45] + "ll"]("[ -:‏-︁" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 48] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + "n]", []) + [];
  let ａ︁ = this["P" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + "ck" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]] + [];
  let ａ︁︁ = this[ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︁[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6]] + [];
  let ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็ = this[ａ︁[7] + ａ︁[2] + ａ︁[7] + "h" + ａ︁︁[4]] + [];
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็;
  let ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[ａ︁︁[20] + ａ︁︁[1] + "U" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]();
  [ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็, ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] = [][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]][ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + (ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ + {})[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 57] + ａ︁[2] + ａ︁[3] + ａ︁[2] + "+" + ａ︁[0] + ａ︁[13] + "," + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + "()" + ａ︁[13])(this);
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂ = this[ａ︁[1].toLowerCase() + ａ︁[2] + ａ︁[3] + ａ︁[2]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "x" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5]](ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็) + [];
  if (ａ︇︇︅︅︅) {
    let ａ︉︇︆︆︆︆︆︆︆︆ = "";
    let ａ︉︉︉︉︉︉︉ = 0;
    for (let ａ︉︆︆︆︆ of ａ︇︇︅︅︅) {
      ａ︉︉︉︉︉︉︉++;
      let ａ︌︌︌︌︌︌︌︌︌︌ = ａ︉︉︉︉︉︉︉ > 8 ? "loading=\"lazy\"" : "";
      let ａ︇︉︆︆ = ａ︉︆︆︆︆.Category;
      if (ａ︇︉︆︆ != 0) {
        let ａ︇︉︆︆︆︆︆︆ = ａ︉︆︆︆︆.UserName;
        let ａ︈︈︅︅︅︅︅︅︅ = (ａ︉︆︆︆︆.Content || "") + "";
        let ａ︎︎︎︎︎︎︎︎︎ = ａ︈︈︅︅︅︅︅︅︅.replace(/\[fn=(\d+)\]/g, (ａ︇︈︅︅︅︅︅, ａ︉︆︆︆︆︆︆︆) => {
          return emojisMap[ａ︉︆︆︆︆︆︆︆];
        }).replace(/\n/g, "<" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ">");
        let ａ︊ = (ａ︉︆︆︆︆.AudioUrl || "") + "";
        if (ａ︊ != "") {
          let ａ︋︋︋︋︋︋︋︋︋ = ａ︉︆︆︆︆.AudioTime;
          ａ︎︎︎︎︎︎︎︎︎ = "<audio src=\"" + ａ︊ + "\" controls>" + ａ︈︈︅︅︅︅︅︅︅ + "</audio>";
        }
        let ａ︋︋︋︋ = ａ︉︆︆︆︆.CreateTime;
        ａ︋︋︋︋ = new Date(ａ︋︋︋︋);
        let ａ︇︉︆︆︆︆︆︆︆ = ａ︋︋︋︋.getUTCFullYear();
        let ａ︈︈︈︈︈︈︈︈ = ａ︋︋︋︋.getUTCMonth() + 1;
        let ａ︈︇︆︆ = ａ︋︋︋︋.getUTCDate();
        let ａ︊︊︊ = ａ︋︋︋︋.getUTCHours();
        let ａ︇︅︅︅ = ａ︋︋︋︋.getUTCMinutes();
        let ａ︇︅︅︅︅︅ = new Date().getFullYear();
        if (ａ︇︉︆︆︆︆︆︆︆ == ａ︇︅︅︅︅︅) {
          ａ︋︋︋︋ = ａ︈︈︈︈︈︈︈︈ + "月" + ａ︈︇︆︆ + "日" + ａ︊︊︊ + ":" + ａ︇︅︅︅;
        } else {
          ａ︋︋︋︋ = ａ︇︉︆︆︆︆︆︆︆ + "年" + ａ︈︈︈︈︈︈︈︈ + "月" + ａ︈︇︆︆ + "日";
        }
        let ａ︈︉︅︅︅︅︅︅ = (ａ︉︆︆︆︆.IpLocation || "") + "";
        let ａ︈︇︅︅︅︅︅ = +ａ︉︆︆︆︆.AgreeAmount || "";
        let ａ︈︅︅︅︅︅︅︅︅︅ = ａ︉︆︆︆︆.RelatedUser;
        if (ａ︈︅︅︅︅︅︅︅︅︅ != "") {
          ａ︈︅︅︅︅︅︅︅︅︅ = "回复 <span>" + ａ︈︅︅︅︅︅︅︅︅︅ + "</span>：";
        } else {
          ａ︈︅︅︅︅︅︅︅︅︅ = "";
        }
        let ａ︉︉︅︅︅︅︅ = ａ︉︆︆︆︆.ImageDetail;
        if (ａ︉︉︅︅︅︅︅ && ａ︉︉︅︅︅︅︅ != "") {
          ａ︉︉︅︅︅︅︅ = "<div class=\"tp\"><img src=\"" + ａ︉︉︅︅︅︅︅ + "\" " + ａ︌︌︌︌︌︌︌︌︌︌ + "></div>";
        } else {
          ａ︉︉︅︅︅︅︅ = "";
        }
        let ａ︈︆︆︆︆ = ａ︉︆︆︆︆.UserHeadIcon;
        let ａ︉︇︅ = ａ︉︆︆︆︆.FrameUrl;
        if (ａ︉︇︅ != "") {
          ａ︉︇︅ = "<img class=\"txk\" src=\"" + ａ︉︇︅ + "\" " + ａ︌︌︌︌︌︌︌︌︌︌ + ">";
        } else {
          ａ︉︇︅ = "";
        }
        let ａ︉︉︅︅︅ = ａ︉︆︆︆︆.TitleInfoList || [];
        let ａ︇︅︅︅︅︅︅ = "";
        for (let ａ︈︈︆︆︆︆︆ of ａ︉︉︅︅︅) {
          let ａ︈︆︆︆︆︆︆ = ａ︈︈︆︆︆︆︆.TitleImage;
          if (ａ︈︆︆︆︆︆︆ == "") {
            let ａ︉︇︅︅︅︅︅︅︅ = ａ︈︈︆︆︆︆︆.TitleName;
            if (ａ︉︇︅︅︅︅︅︅︅ != "") {
              ａ︇︅︅︅︅︅︅ += "<svg class=\"tag\" viewBox=\"0 0 " + (ａ︉︇︅︅︅︅︅︅︅.length() * 15 + 20) + " 40\"><rect width=\"100%\" height=\"70%\" y=\"15%\" rx=\"8\" ry=\"8\" fill=\"#D25A28\"/><text x=\"50%\" y=\"50%\">" + ａ︉︇︅︅︅︅︅︅︅ + "</text></svg>";
            }
          } else {
            ａ︇︅︅︅︅︅︅ += "<img class=\"tag\" src=\"" + ａ︈︆︆︆︆︆︆ + "\" " + ａ︌︌︌︌︌︌︌︌︌︌ + ">";
          }
        }
        let ａ︉︈︆︆︆︆︆︆︆ = ａ︇︉︆︆ < 6 ? "<div class=\"txv\"><img class=\"tx\" src=\"" + ａ︈︆︆︆︆ + "\" " + ａ︌︌︌︌︌︌︌︌︌︌ + ">" + ａ︉︇︅ + "</div><div class=\"p\"><p class=\"p1\"><span>" + ａ︇︉︆︆︆︆︆︆ + "</span>" + ａ︇︅︅︅︅︅︅ + "</p>" : "<div class=\"txv\"></div><div class=\"p\"><p class=\"p1\"><img class=\"tx2\" src=\"" + ａ︈︆︆︆︆ + "\" " + ａ︌︌︌︌︌︌︌︌︌︌ + "><span>" + ａ︇︉︆︆︆︆︆︆ + "</span>" + ａ︇︅︅︅︅︅︅ + "</p>";
        let ａ︈︇︅︅︅ = ａ︉︈︆︆︆︆︆︆︆ + "<p class=\"p2\">" + ａ︈︅︅︅︅︅︅︅︅︅ + ａ︎︎︎︎︎︎︎︎︎ + "</p>" + ａ︉︉︅︅︅︅︅ + "<p class=\"p3\">" + ａ︋︋︋︋ + (ａ︈︉︅︅︅︅︅︅ ? "<span>\u3000▪\u3000</span>" + ａ︈︉︅︅︅︅︅︅ : ａ︈︉︅︅︅︅︅︅) + "</p></div><div class=\"dz\"><svg aria-hidden=\"true\" class=\"dzt\"><use xlink:href=\"#dzs\"/></svg><span>" + ａ︈︇︅︅︅︅︅ + "</span></div>";
        ａ︉︇︆︆︆︆︆︆︆︆ += "<div class=\"li\">" + ａ︈︇︅︅︅ + "</div>";
      }
    }
    return ａ︉︇︆︆︆︆︆︆︆︆;
  }
  let ａ︇︈︆︆︆ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[2]];
  let ａ︎ = this.cache.get("z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4)).split(ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 2))[3];
  let ａ︉︆︆︆︆︆︆ = ａ︇︈︆︆︆[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[24] + ａ︁[2] + ａ︁[7] + "B" + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5]]("0" + (ａ︎ + ａ︅︅︅︅︅︅︅) + "2EEE1433A152E84B3756301D8FA3E69A", ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[24] + "A" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "-" + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + "A" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[41 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็], ａ︎);
  let ａ︇︇︅︅︅︅︅︅︅ = Packages.android.util.Base64;
  let ａ︍︍ = ａ︉︆︆︆︆︆︆[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁[0] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](0, -4);
  let ａ︇︆︆︆︆︆︆︆ = ａ︇︈︆︆︆[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]("AAAAAAAAAAA" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1));
  try {
    let ａ︇︇︅︅︅︅ = this[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]]();
    var ａ︉︉︉︉ = ａ︇︈︆︆︆[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︇︇︅︅︅︅ + this[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20]](ａ︇︈︆︆︆[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︁[7] + "z" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁[3] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[3] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + "W" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + "YW" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[26] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + "ZW" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[3] + "W" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁︁[27] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[24] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + "Y" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[77 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁︁[20] + "X" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0]))[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]]());
    let ａ︉︉︆︆︆︆︆︆︆ = ａ︇︈︆︆︆[ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1]]("A" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︉︉︉︉)[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]]("7u+lcf7hCkkbD+HBnnmXrpqxr4YHLK9Gjt6wAVb36Kuasa+GByyvRo7esAFW9+irmrGvhgcsr0aO3rABVvfoq5qxr4YHLK9Gjt6wAVb36KuHbOBXvCGzL9ApKXfr59z5");
    var ａ︇︇︆︆︆ = ａ︇︈︆︆︆[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︉︉︆︆︆︆︆︆︆);
    if (ａ︇︇︆︆︆) {
      throw "";
    }
    ａ︇︇︆︆︆ = ａ︇︈︆︆︆[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "U" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[0]](ａ︇︇︆︆︆);
  } catch (ａ︈︆︆︆) {
    for (let ａ︋︋︋︋︋︋︋︋ = 0; ａ︋︋︋︋︋︋︋︋ < (ａ︉︆︆︆︆︆︆ = (ａ︈︆︆︆ + "").length); ａ︋︋︋︋︋︋︋︋++) {
      ａ︇︈︆︆︆.toast("🤫当前" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 557 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 3 + 0) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 786 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 2) + "暂不开放");
      Packages.java.lang.Thread.sleep(50);
    }
  }
  let ａ︍︍︍︍︍︍︍︍︍︍ = ａ︇︈︆︆︆[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︇︇︆︆︆ + ａ︍︍ + ａ︎);
  let ａ︈︅ = ａ︇︈︆︆︆[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1]]("A" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︉︉︉︉)[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]]("r6M0ilk9O7PCWuj+kHofc/C5g15oVus5LM0GDeQ2BnbwuYNeaFbrOSzNBg3kNgZ28LmDXmhW6zkszQYN5DYGdvC5g15oVus5LM0GDeQ2BnbwuYNeaFbrOSzNBg3kNgZ28LmDXmhW6zkszQYN5DYGdvC5g15oVus5LM0GDeQ2BnYmCnOvNRTyQ090Ts4P2mYj");
  let ａ︇︇ = ａ︇︈︆︆︆[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "x" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + "B" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "A" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4]](ａ︈︅ + ａ︍︍︍︍︍︍︍︍︍︍);
  let ａ︈︆︆ = Packages.cn.hutool.crypto.digest.DigestUtil.md5(ａ︇︇);
  let ａ︈︈︆︆︆ = "";
  if (ａ︉︆︆︆︆︆︆) {
    ａ︈︈︆︆︆ = ａ︇︈︆︆︆.base64Encode(ａ︈︆︆);
  } else {
    ａ︈︈︆︆︆ = ａ︇︇︅︅︅︅︅︅︅.encodeToString(ａ︈︆︆, ａ︇︇︅︅︅︅︅︅︅.NO_WRAP);
  }
  let ａ︈︈︈︈ = ａ︇︈︆︆︆[ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1]](ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[12 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︈︈︆︆︆, ａ︇︆︆︆︆︆︆︆).decrypt(Array.from(ａ︉︈︆︆︆︆︆︆︆︆)[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](8, -16));
  let ａ︈︈︅︅ = ａ︇︈︆︆︆[ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1]](ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + "B" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "K" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5], ａ︍︍, ａ︇︆︆︆︆︆︆︆)[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︈︈︈︈);
  return ａ︈︈︅︅;
}
function jiesuo(ａ︅︅︅︅︅︅︅︅︅, ａ︈︉︆︆︆︆︆︆, ａ︈︉︅︅, ａ︆︆) {
  let ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็ = "jl4SGVlycyuedu486atdsApds7695oe0dfj23wncgxzdDg56SAFH2b3571ahGdsFzh";
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ = this.java.base64Decode("bGVuZ3Ro") + [];
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀ = this[this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("c291cmNl")][this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("a2V5")]["r" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + "l" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 45] + "ll"]("[ -:‏-︁" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 48] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + "n]", []) + [];
  let ａ︁ = this["P" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + "ck" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]] + [];
  let ａ︁︁ = this[ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︁[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6]] + [];
  let ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็ = this[ａ︁[7] + ａ︁[2] + ａ︁[7] + "h" + ａ︁︁[4]] + [];
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็;
  let ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[ａ︁︁[20] + ａ︁︁[1] + "U" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]();
  [ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็, ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] = [][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]][ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + (ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ + {})[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 57] + ａ︁[2] + ａ︁[3] + ａ︁[2] + "+" + ａ︁[0] + ａ︁[13] + "," + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + "()" + ａ︁[13])(this);
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂ = this[ａ︁[1].toLowerCase() + ａ︁[2] + ａ︁[3] + ａ︁[2]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "x" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5]](ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็) + [];
  let ａ︉︅︅︅︅︅︅︅ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[2]];
  let ａ︉︆︆︆︆︆︆︆︆ = this[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[33 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]];
  if (ａ︅︅︅︅︅︅︅︅︅ == "") {
    ａ︅︅︅︅︅︅︅︅︅ = this[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]](1);
    if (ａ︈︉︆︆︆︆︆︆ < 1) {
      return ａ︅︅︅︅︅︅︅︅︅[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁[0] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](-32);
    }
    if (this[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + "V" + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁[2] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]]()[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + "W" + ａ︁︁[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14]](ａ︅︅︅︅︅︅︅︅︅[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](0, -32))) {
      if (ａ︈︉︅︅) {
        return com[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4]][ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14]][ａ︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + ａ︁[2] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]](ａ︈︉︆︆︆︆︆︆, ａ︈︉︅︅);
      }
      return this["q" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + "z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4)]();
    }
    return "";
  }
  let ａ︌︌︌︌︌︌ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27]];
  if (ａ︈︉︆︆︆︆︆︆) {
    let ａ︉︅︅︅ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁[20] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + "q" + ａ︁︁[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁[0] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13];
    let ａ︉︉︅︅︅︅︅︅︅ = ａ︉︆︆︆︆︆︆︆︆.getKey(ａ︉︅︅︅, "_" + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26]) + "";
    if (!ａ︉︉︅︅︅︅︅︅︅) {
      ａ︉︆︆︆︆︆︆︆︆.removeCookie(ａ︉︅︅︅);
      ａ︉︅︅︅︅︅︅︅.ajax(this[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]](ａ︉︅︅︅ + "/book/" + ａ︈︉︆︆︆︆︆︆ + "/"));
      ａ︉︉︅︅︅︅︅︅︅ = ａ︉︆︆︆︆︆︆︆︆.getKey(ａ︉︅︅︅, "_" + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26]) + "";
    }
    let ａ︈︈︈ = ａ︆︆ ? ａ︉︅︅︅ + "/majax/chapterReview/reviewSummary?bookId=" + ａ︈︉︆︆︆︆︆︆ + "&chapterId=" + ａ︆︆ + "&_csrfToken=" + ａ︉︉︅︅︅︅︅︅︅ : ａ︉︅︅︅ + "/majax/book/category?bookId=" + ａ︈︉︆︆︆︆︆︆ + "&_csrfToken=" + ａ︉︉︅︅︅︅︅︅︅;
    return ａ︉︅︅︅︅︅︅︅.ajax(this[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]](ａ︈︈︈, ａ︉︉︅︅︅︅︅︅︅));
  }
  if (ａ︅︅︅︅︅︅︅︅︅.startsWith("笔趣阁")) {
    return 2;
  }
  ａ︅︅︅︅︅︅︅︅︅ = ａ︅︅︅︅︅︅︅︅︅.replace(/^[^h]+/, "");
  let ａ︈︉︅ = this.chapter;
  let ａ︇︉︅ = ａ︉︅︅︅︅︅︅︅[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](String(ａ︈︉︅.url).match(/.+,(.+),.+/)[1]);
  let ａ︈︈︅ = ａ︌︌︌︌︌︌.getVariable("nurl" + ａ︇︉︅) + "";
  let ａ︈︇︅︅ = ａ︈︈︅ && ａ︉︅︅︅︅︅︅︅[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︈︈︅.match(/.+,(.+),.+/)[1]);
  let ａ︉︅︅︅︅︅︅︅︅︅ = ａ︌︌︌︌︌︌.getVariable("uvip" + ａ︈︇︅︅) + "";
  if (ａ︈︈︅ && ａ︉︅︅︅︅︅︅︅︅︅) {
    ａ︉︅︅︅︅︅︅︅.longToast("手动替换章节\n" + ａ︈︉︅.title);
    Packages.java.lang.Thread.sleep(500);
    let ａ︌ = ａ︉︅︅︅︅︅︅︅.startBrowserAwait(ａ︅︅︅︅︅︅︅︅︅, "手动替换", false).body();
    ａ︌︌︌︌︌︌.putVariable("avip" + ａ︇︉︅, ａ︌);
    return 1;
  }
  let ａ︊︊︊︊ = new RegExp(dqurl + "|" + sdgurl);
  let ａ︇︇︅︅ = ａ︊︊︊︊.test(ａ︅︅︅︅︅︅︅︅︅) ? ａ︉︆︆︆︆︆︆︆︆.getCookie(ａ︅︅︅︅︅︅︅︅︅) : "";
  let ａ︌︌ = ａ︉︅︅︅︅︅︅︅.ajax(this[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︅︅︅︅︅︅︅︅︅, ａ︇︇︅︅));
  if (/69shux\.co/.test(ａ︅︅︅︅︅︅︅︅︅)) {
    ａ︌︌ = ａ︉︅︅︅︅︅︅︅.t2s(ａ︌︌);
  }
  let ａ︉︈︆︆︆︆︆︆ = this[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁[2]](ａ︌︌);
  let ａ︉︅ = org.jsoup.Jsoup.parse(ａ︌︌);
  let ａ︆︆︆ = ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 9 + 4) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁[20] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + "W" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + "x" + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 4) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 554 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 5 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 554 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 4 + 0) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 1084 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 0 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 6 + 5);
  ａ︉︅ = ａ︉︅.select(ａ︆︆︆).attr(ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59]);
  while (ａ︉︅ != "") {
    let ａ︇︉︅︅︅︅︅ = ａ︅︅︅︅︅︅︅︅︅.replace(/\#.*$/, "") + ａ︉︅;
    ａ︉︅︅︅︅︅︅︅.toast(`
加载目录下一页
链接` + ａ︉︅);
    let ａ︈︈︆︆︆︆ = ａ︉︅︅︅︅︅︅︅.ajax(this[ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9]](ａ︇︉︅︅︅︅︅));
    ａ︉︈︆︆︆︆︆︆.addAll(this[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[9 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁[2]](ａ︈︈︆︆︆︆));
    ａ︉︅ = org.jsoup.Jsoup.parse(ａ︈︈︆︆︆︆);
    ａ︉︅ = ａ︉︅.select(ａ︆︆︆).attr(ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59]);
  }
  ａ︉︅︅︅︅︅︅︅.log("解锁结果目录：\n" + ａ︉︈︆︆︆︆︆︆);
  let ａ︈︇︅︅︅︅ = ａ︌︌︌︌︌︌.getVariable(ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3]);
  let ａ︈︈ = ａ︉︈︆︆︆︆︆︆.length;
  if (ａ︈︈ > ａ︈︇︅︅︅︅) {
    ａ︌︌︌︌︌︌.putVariable(ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3], ａ︈︈);
    ａ︌︌︌︌︌︌.putVariable("z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4), ａ︉︈︆︆︆︆︆︆);
    ａ︉︅︅︅︅︅︅︅.longToast("最新章节：\n" + ａ︉︈︆︆︆︆︆︆[ａ︈︈ - 1].text());
    Packages.java.lang.Thread.sleep(1000);
    return 1;
  } else if (ａ︈︈ > 9) {
    ａ︌︌︌︌︌︌.putVariable(ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3], ａ︈︈);
    ａ︌︌︌︌︌︌.putVariable("z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4), ａ︉︈︆︆︆︆︆︆);
    ａ︉︅︅︅︅︅︅︅.longToast("\n解锁资源没有新章节" + []);
    return 0;
  } else {
    ａ︉︅︅︅︅︅︅︅.longToast("\n解锁目录链接访问异常，使用手动解锁" + []);
    Packages.java.lang.Thread.sleep(400);
    return this["q" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + "z" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4)](ａ︅︅︅︅︅︅︅︅︅);
  }
}
function getresult(ａ︉︈︆︆, ａ︇︉︅︅, ａ︊︊︊︊︊︊, ａ︇︅︅︅︅︅︅︅︅, ａ︉) {
  let ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็ = "jl4SGVlycyuedu486atdsApds7695oe0dfj23wncgxzdDg56SAFH2b3571ahGdsFzh";
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ = this.java.base64Decode("bGVuZ3Ro") + [];
  let ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀ = this[this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("c291cmNl")][this.java[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 13] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 46] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 50] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 64] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 22] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 37] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 54] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55]]("a2V5")]["r" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + "l" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 49] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 55] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 45] + "ll"]("[ -:‏-︁" + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 7] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 48] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 44] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 58] + "n]", []) + [];
  let ａ︁ = this["P" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + "ck" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[5] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0]] + [];
  let ａ︁︁ = this[ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[3] + ａ︁[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[6]] + [];
  let ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็ = this[ａ︁[7] + ａ︁[2] + ａ︁[7] + "h" + ａ︁︁[4]] + [];
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็;
  let ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็ = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็ = ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[ａ︁︁[20] + ａ︁︁[1] + "U" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]]();
  [ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็, ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] = [][ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11]][ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]](ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30], ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[12] + ａ︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + (ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ + {})[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] - 57] + ａ︁[2] + ａ︁[3] + ａ︁[2] + "+" + ａ︁[0] + ａ︁[13] + "," + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁[7] + ａ︁︁[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[30] + ａ︁[2] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + "()" + ａ︁[13])(this);
  let ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂ = this[ａ︁[1].toLowerCase() + ａ︁[2] + ａ︁[3] + ａ︁[2]][ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "x" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[30] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5]](ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็) + [];
  if (ａ︉︈︆︆.length < 10 || ａ︇︉︅︅ != 0) {
    return "";
  }
  ａ︉︈︆︆ = ａ︉︈︆︆.replace(/\/$/, "");
  let ａ︇︆︆︆︆ = this[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁[2] + ａ︁[3] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]];
  let ａ︈︅︅︅︅︅︅︅ = "B" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + "F" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[77 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11];
  let ａ︈︅︅︅︅ = ａ︇︆︆︆︆.androidId();
  function ａ︈︅︅︅︅︅(ａ︍︍︍︍) {
    function ａ︉︈︅︅︅︅︅︅(ａ︉︉︆︆︆︆, ａ︉︅︅︅︅︅) {
      let ａ︇︉︅︅︅︅ = ａ︉︅︅︅︅︅.length;
      let ａ︇︇︆︆︆︆ = new Uint8Array(ａ︉︉︆︆︆︆.length);
      for (let ａ︅ = 0; ａ︅ < ａ︉︉︆︆︆︆.length; ａ︅++) {
        let ａ︅︅︅︅︅︅︅︅ = ａ︉︉︆︆︆︆[ａ︅] & 255;
        ａ︇︇︆︆︆︆[ａ︅] = ａ︅︅︅︅︅︅︅︅ ^ ａ︉︅︅︅︅︅[ａ︅ % ａ︇︉︅︅︅︅];
      }
      return ａ︇︇︆︆︆︆;
    }
    function ａ︈︈︅︅︅︅︅︅︅︅(ａ︈︆︆︆︆︆︆︆︆, ａ︈︈︈︈︈︈︈︈︈︈, ａ︈︉︆︆︆︆︆︆︆) {
      let ａ︈︉︆ = ａ︈︆︆︆︆︆︆︆︆ + ａ︈︈︈︈︈︈︈︈︈︈.toString() + ａ︈︉︆︆︆︆︆︆︆;
      let ａ︈︉︆︆︆︆︆ = ａ︈︉︆.length;
      let ａ︇︅︅︅︅ = new Uint8Array(32);
      for (let ａ︌︌︌︌︌︌︌︌︌ = 0; ａ︌︌︌︌︌︌︌︌︌ < 32; ａ︌︌︌︌︌︌︌︌︌++) {
        ａ︇︅︅︅︅[ａ︌︌︌︌︌︌︌︌︌] = ａ︈︉︆.charCodeAt(ａ︌︌︌︌︌︌︌︌︌ % ａ︈︉︆︆︆︆︆);
      }
      for (let ａ︊︊︊︊︊︊︊ = 0; ａ︊︊︊︊︊︊︊ < 3; ａ︊︊︊︊︊︊︊++) {
        for (let ａ︆︆︆︆︆︆︆ = 0; ａ︆︆︆︆︆︆︆ < 32; ａ︆︆︆︆︆︆︆++) {
          ａ︇︅︅︅︅[ａ︆︆︆︆︆︆︆] = ａ︇︅︅︅︅[ａ︆︆︆︆︆︆︆] ^ ａ︇︅︅︅︅[(ａ︆︆︆︆︆︆︆ + 1) % 32];
          ａ︇︅︅︅︅[ａ︆︆︆︆︆︆︆] = (ａ︇︅︅︅︅[ａ︆︆︆︆︆︆︆] << 3 | ａ︇︅︅︅︅[ａ︆︆︆︆︆︆︆] >> 5) & 255;
        }
      }
      return ａ︇︅︅︅︅;
    }
    function ａ︉︇︆︆︆(ａ︇︇︅︅︅︅︅︅) {
      const ａ︉︅︅︅︅ = "AB" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + "F" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[0] + ａ︁[1] + "K" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[24] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[26] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[1] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[11] + "Q" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[30] + "TUVWXYZ" + ａ︁[2] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[7] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 17 + 4) + ａ︁︁[27] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + "q" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[3] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + "x" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + "z" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5);
      let ａ︈︅︅︅ = "";
      let ａ︇︇︇︇︇︇︇︇︇︇;
      const ａ︉︇︆︆︆︆︆︆ = ａ︇︇︅︅︅︅︅︅.length;
      for (ａ︇︇︇︇︇︇︇︇︇︇ = 2; ａ︇︇︇︇︇︇︇︇︇︇ < ａ︉︇︆︆︆︆︆︆; ａ︇︇︇︇︇︇︇︇︇︇ += 3) {
        ａ︈︅︅︅ += ａ︉︅︅︅︅[ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] >> 2];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[(ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] & 3) << 4 | ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 1] >> 4];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[(ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 1] & 15) << 2 | ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇] >> 6];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇] & 63];
      }
      if (ａ︇︇︇︇︇︇︇︇︇︇ === ａ︉︇︆︆︆︆︆︆ + 1) {
        ａ︈︅︅︅ += ａ︉︅︅︅︅[ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] >> 2];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[(ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] & 3) << 4];
        ａ︈︅︅︅ += ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1);
      }
      if (ａ︇︇︇︇︇︇︇︇︇︇ === ａ︉︇︆︆︆︆︆︆) {
        ａ︈︅︅︅ += ａ︉︅︅︅︅[ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] >> 2];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[(ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 2] & 3) << 4 | ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 1] >> 4];
        ａ︈︅︅︅ += ａ︉︅︅︅︅[(ａ︇︇︅︅︅︅︅︅[ａ︇︇︇︇︇︇︇︇︇︇ - 1] & 15) << 2];
        ａ︈︅︅︅ += ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 1);
      }
      return String(ａ︈︅︅︅);
    }
    let ａ︉︈︆︆︆︆ = Math.floor(Date.now() / 1000);
    let ａ︉︉︆︆︆ = ａ︈︅︅︅︅;
    let ａ︇︇︅︅︅︅︅︅︅︅ = {
      UUID: ａ︉︉︆︆︆
    };
    if (true) {
      let ａ︇︇︇︇ = ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[27] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁[27] + "-" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็];
      let ａ︇︆ = ａ︍︍︍︍.match(/^[^/]+:\/\/[^/]+([^#]*)/)[1];
      let ａ︉︅︅ = ａ︈︈︅︅︅︅︅︅︅︅(ａ︇︇︇︇, ａ︉︈︆︆︆︆, ａ︇︆);
      let ａ︎︎︎︎︎︎︎︎︎︎ = ａ︇︆︆︆︆[ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[24] + ａ︁[2] + ａ︁[7] + "B" + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5]](ａ︉︉︆︆︆ + ａ︉︈︆︆︆︆, ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁[2] + ａ︁[7] + ａ︁︁[30] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[14] + "A" + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0], ａ︇︇︇︇);
      let ａ︉︉︉︉︉ = ａ︇︆︆︆︆[ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[5] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "T" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + "B" + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + "A" + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4]](ａ︎︎︎︎︎︎︎︎︎︎);
      let ａ︇︉︆︆︆︆︆ = ａ︉︈︅︅︅︅︅︅(ａ︉︉︉︉︉, ａ︉︅︅);
      let ａ︋︋︋︋︋︋ = ａ︉︇︆︆︆(ａ︇︉︆︆︆︆︆);
      ａ︇︇︅︅︅︅︅︅︅︅.Authorization = ａ︋︋︋︋︋︋;
      ａ︇︇︅︅︅︅︅︅︅︅.timestamp = String(ａ︉︈︆︆︆︆);
      ａ︇︇︅︅︅︅︅︅︅︅.UFRAY = ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[12 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁[2] + ａ︁[2] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[6] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[45] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[35] + ａ︁[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[31] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[37 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁[7] + ａ︁[7] + ａ︁[7] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[71] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[4] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[41 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[0] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2);
    }
    return ａ︍︍︍︍ + ",{\"headers\":" + JSON.stringify(ａ︇︇︅︅︅︅︅︅︅︅) + "}";
  }
  try {
    if (ａ︉︈︆︆.includes(ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[27] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2])) {
      if (!ａ︉︈︆︆.includes(ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3))) {
        ａ︉︈︆︆ += ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[65 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3);
      }
      return getresultl(7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็, ａ︇︆︆︆︆.ajax(ａ︈︅︅︅︅︅(ａ︉︈︆︆ + "bookId=" + ａ︊︊︊︊︊︊ + "&chapterId=" + ａ︇︅︅︅︅︅︅︅︅)));
    } else if (ａ︉︈︆︆.includes(ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁[2] + ａ︁︁[20] + ａ︁︁[0] + ａ︁[7] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[8 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[0])) {
      return getresultl(2, ａ︇︆︆︆︆.ajax(ａ︉︈︆︆ + "bookId=" + ａ︊︊︊︊︊︊ + "&chapterId=" + ａ︇︅︅︅︅︅︅︅︅));
    }
    if (ａ︉︈︆︆.includes(ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[33 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 16 + 2) + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁[27] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2])) {
      if (!ａ︉︈︆︆.includes(ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3))) {
        ａ︉︈︆︆ += ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[7 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[4] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ ** 2 * 3 + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 1 + 5) + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[20 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[36 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[10 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3);
      }
      return getresultl(1, ａ︇︆︆︆︆.ajax(ａ︈︅︅︅︅︅(ａ︉︈︆︆ + "bookId=" + ａ︊︊︊︊︊︊ + "&chapterId=" + ａ︇︅︅︅︅︅︅︅︅)));
    } else if (ａ︉︈︆︆.includes(ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[3] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[5] + "x" + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2])) {
      if (!ａ︉︈︆︆.includes(ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[13 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[19 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[25 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3))) {
        ａ︉︈︆︆ += ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[20] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[15 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 7 + 5) + ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[32 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[11] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[17 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︀ａۖۖۖۗۖۖۖۖۗ็็็็[ａ︁[7] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[26] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[0] + ａ︁︁[20] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[2] + ａ︁[7] + ａ︁︁[26 - ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30]][ａ︁︁︁︁ａۖۖۖۖۖۖۗۗۗۗۖۖۖۖۖۖۖۗۗۗۗ็็็็็็็︂︂[59] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[13] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[14] + ａ︁[2] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[30] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[19] + ａ︁︁︁︁︁ａۖۖۖۖۖۖۖۗۗۗۗۗۖۖۖۖۖۖۖۖۗۗۗۗۗ็็็็็็็็[1] + ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็︀[9] + ａ︁︁︁ａۖۖۖۖۖۗۗۗۖۖۖۖۖۖۗۗۗ็็็็็็[4]](ａ︀︀ａۖۖۖۖۗۗۖۖۖۖۖۗۗ็็็็็ * 10 + 3);
      }
      return getresultl(3, ａ︇︆︆︆︆.ajax(ａ︉︈︆︆ + "ban=B7sF2P&bookId=" + ａ︊︊︊︊︊︊ + "&chapterId=" + ａ︇︅︅︅︅︅︅︅︅ + "&device=" + ａ︈︅︅︅︅ + "&key=" + ａ︉));
    }
  } catch (ａ︇︇︆︆︆︆︆) {
    ａ︇︆︆︆︆.log(ａ︇︇︆︆︆︆︆);
  }
  return "";
}
//🌈

function getresultl(x,y) {
    let r="";
    if (x==1) {
        r=JSON.parse(y).data;}
    if (x==2) {
        r=JSON.parse(y).content;}
    if (x==3) {
        r=JSON.parse(y).data.content;}
    if (r?.length>19) return r;
    return '';
}

var qdurl='https://druidv6.if.qidian.com'; //起点
var qdturl='https://www.qidiantu.com'; //起点图
sdgurl='https://www.sudugu.org'; //速读谷
dqurl='https://www.deqibook.com'; //得奇
lbhurl='https://www.libahao.com'; //篱笆好
wxurl='https://www.wxsck.com'; //万相
s__u='https://m.bqgp.cc'; //笔趣阁
var x_r_w='com.mmbox.xbrowser'; //浏览器型号
var lycurl="https://gitee.com/lyc486/yuedu2/raw/main/%E4%B9%A6%E6%BA%90/%E8%B5%B7%E7%82%B9%E5%8A%A9%E6%89%8B/jj/qdzs.json"; //本体加载链接
var lycnm="qdzscode"; //忘了

function gets(x,r,z) {return r==undefined?String(this.java.getString(x)):z==undefined?String(this.java.getString(x,r)):String(z.getString(x,r));}

function ml69a(webr) {
let pjr0 = this.org.jsoup.Jsoup.parse(webr);
let pjr = pjr0.select('#chapters li, #catalog li, #list li, ul.all-chapters li, #all-chapter>div');
if (pjr=='') pjr=pjr0.select('h3:matchesWholeOwnText(章节列表)+ul>li');
if (pjr=='') pjr=pjr0.select('ul>li');
if (pjr.select('li:first-child').attr('data-num')>9) {
	let Collections=Packages.java.util.Collections;
	Collections.reverse(pjr);}
	return pjr.select('a');
}

//点击视频图
function videoh(url,title,purl,bkid,zcid) {
	const { java, cache} = this;
	let zssj = cache.get('zssj').split(',');
    let url3 = this.QDSign("v3/midpage/pageinfo", ["bookId=" + bkid, "chapterId=" + zcid, "needAdv=0"]);java.ajax(url3);
	let ua=`Dalvik/2.1.0 (Linux; U; Android 10; ${zssj[1]} Build/UKQ1.230924.001)`;
java.openVideoPlayer(`${url},{"headers":{"User-Agent":"${ua}","referer":"https://www.qidian.com"}}`,"彩蛋章",true)
}


function qdzspj(uuu) {
	const { java, source, book, cookie} = this;
	let vip=book.getVariable("vip");
	if (vip=='1') {
		let keyy='';
		try {
        let cf =this.tcolor()[0];
		let sv=`<text fill="#${cf}"`;
			let svg=`
			<svg width="2000" height="760" xmlns="http://www.w3.org/2000/svg">
${sv} dominant-baseline="middle" font-weight="bold" font-size="100" xml:space="preserve">
			<tspan x="50%" dy="2ex" text-anchor="middle">
			《${book.name}》</tspan>
			<tspan x="4ex" dy="2ex">方法①输入支持网站的目录页链接</tspan>
			<tspan x="5ex" dy="2ex" >目前支持网站：篱笆好,69</tspan>
			<tspan x="4ex" dy="2ex">方法②输入“万相”“速读”“得奇”</tspan>
			<tspan x="5ex" dy="2ex" >然后在书籍目录页点“✓”</tspan>
			<tspan x="4ex" dy="2ex" >方法③输入“笔趣阁”后自动尝试解锁</tspan>
			</text>
			</svg>`;
svg=java.base64Encode(svg);
if (uuu) keyy='手动解锁';
else keyy=String(java.getVerificationCode('data:image/svg+xml;base64,'+svg));
if (keyy.startsWith('data:')) keyy = java.base64Decode(keyy.replace(/.+,(.+),.+/,'$1'))+[];
} catch(err) {}
Packages.java.lang.Thread.sleep(200);
if (keyy=='笔趣阁') return 2;
let webr='', url='', purl='', bkbl='';
if (keyy=='69') {
java.openUrl('https://www.69shuba.com/modules/article/search.php');return 0;}
if (['万相','速读','得奇','手动解锁'].includes(keyy)) {
	switch (keyy) {
		case '得奇': url=dqurl+'/tag/?key='+book.name;purl=dqurl;break;
		case '速读': url=sdgurl+'/i/sor.aspx?key='+book.name;purl=sdgurl;break;
		case '万相': url=wxurl+'/plus/search.php?q='+book.name;purl=wxurl;break;
		case '手动解锁': url=uuu;break;
		}
	let ck=uuu?cookie.getCookie(url):'';
	webr = java.startBrowserAwait(this['gethd'](url,ck),'选择目录页',false);
	Packages.java.lang.Thread.sleep(100);
	url=String(webr.url()).replace(/#dir$/,'');
	webr=webr.body();
	bkbl=url;

} else if (/^[^h]*https?:/.test(keyy)) {
	//输入链接
	bkbl=keyy;
	if (/\.co\/book/.test(keyy)) {
		keyy=keyy.replace(/book\/(\d+)\/index/,'ajax_novels/chapterlist/$1');}
		url=keyy.replace(/^[^h]+/,'');
		webr = java.ajax(this['gethd'](url));
if (/69shux\.co/.test(keyy)) webr=java.t2s(webr);
	} else {	java.longToast('无效输入'); return 0;}
if (url) {
	let pjr = this.ml69a(webr);
	let xyy = org.jsoup.Jsoup.parse(webr);
	let xzstr='a.gr:matchesWholeText(下一页)';
	xyy = xyy.select(xzstr).attr('href');
	while (xyy!='') {
		let xyyu=url.replace(/\#.*$/,'')+xyy;
		java.toast('\n加载目录下一页\n链接'+xyy);
		let ck=uuu?cookie.getCookie(uuu):'';
		let webr2=java.ajax(this['gethd'](xyyu,ck));
		pjr.addAll(this.ml69a(webr2));
		xyy = org.jsoup.Jsoup.parse(webr2);
		xyy = xyy.select(xzstr).attr('href');}
		if (pjr.length>book.totalChapterNum*3/5) {
	java.log('解锁结果：\n'+pjr);
	book.putVariable("custom", bkbl);
	book.putVariable("zspj",pjr);
	java.toast('解锁成功'); return 1;
	} 	else {java.longToast('😫结果只有'+pjr.length+'章'); return 0;}
	} else {java.longToast('😱未获取到目录链接'); return 0;}

} else {java.longToast('\n《'+book.name+'》\n没有收费啦😮‍💨'); return 0;}
}


function loading(sk){
	let java = this.java;
//移植自游客笔趣阁
let su=s__u,
q="?q="+java.encodeURI(sk);
let c="Hm_lvt_="+~~(Date.now()/1e3);
let head={
	"User-Agent": u_a,
	"accept": "application/json",
	"accept-language": a_l,
	"referer": s__u,
	"cookie": String(c)
};
let hm=java.head(su+"/user/hm.html"+q,head).cookies().hm;
head.cookie = String(head.cookie+hm);
let get=java.get(su+"/user/search.html"+q, head).body();
//返回列表
return JSON.parse(get);
}

function sjzc () {
const { java, cache, cookie} = this;
["https://www.qidian.com","https://www.luoyacheng.ip-ddns.com"].forEach(u=>cookie.removeCookie(u));
let sj1 = Math.floor(Math.random()*1001)+1000;
	let pp = ['realme','OPPO','Xiaomi','vivo','HUAWEI','samsung','Google','HONOR'];
	let ppl = ['RMX3366','PHY120','24030PN60C','V2324A','ALN-AL10','SM-S9280','Pixel 4 XL','MAA-AN10'];
	let sjs = Math.floor(Math.random()*pp.length);
	let sj2=ppl[sjs];
	let sj3=pp[sjs];
	let tm = java.timeFormatUTC(Date.now(),"yyyyMMddHHmmsss",28800000);
	let qimei = tm+sjmac();
	let zssj = String([sj1,sj2,sj3,qimei]);
	cache.put('zssj',zssj);
	java.log('注册信息：'+zssj);
this.ftjs(6)!=''&&java.toast('\n注册成功');
}
function sjmac() {
	function hdsjs(x) {
		let s = '0123456789abcdef';
		if (x==1) s = '0123456789';
		return s[Math.floor(Math.random()*s.length)];}
    let mac = '';
    for (let i = 0; i < 6; i++) {
        if (i > 0) {mac += ':';}
        for (let j = 0; j < 2; j++) {mac+=hdsjs(0);}
    }
    for (let k = 0; k < 6; k++) {mac+=hdsjs(1);}
    return mac;
}

u_a = "Mozilla/5.0 (Linux; Android 10; K) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/136.0.0.0 Mobile Safari/537.36 EdgA/136.0.0.0";
u_ap = "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/136.0.0.0 Safari/537.36 Edg/136.0.3240.91";
s_c_ua = `"Chromium";v="136", "Microsoft Edge";v="136", "Not.A/Brand";v="99"`;
s_c_ua_m = "?1";
s_c_ua_mp = "?0";
s_c_ua_p =  `"Android"`;
s_c_ua_pp =  `"Linux"`;
cache_c = "max-age=0";
a_l = "zh-CN,zh;q=0.9,en-US;q=0.8,en;q=0.7";



//月票活动检测
function lookyp(rr3) {
	let java=this.java;
    let cache = this.cache;
	let acyp = com.jayway.jsonpath.JsonPath.read(rr3,'$.*.Activities[*][?(@.ActivityName =~ /^【月票】.*/)]');
    let kg = cache.getFromMemory("qdzsmls");
let sz=[];
if (kg) {
    sz = cache.getFromMemory("qdzsypsz")||sz;
}
for (let char of acyp) {
let acjj=java.getString('$..ActivityDesc',char);
let mb=(acjj.match(/标⽉票】\s*(\d{2,})/)||['','1'])[1];
let sd=java.getString('$..MonthTicket',char);
if (+mb>+sd) {
	let acnm=java.getString('$..ActivityName',char);
	acnm=acnm.replace('【月票】','');
	let jl=java.getString('$..ActivityDesc',char);
	jl=(jl.match(/月票奖励】\s*(.+)/)||['','出错'])[1];
	let rs=java.getString('$..RegisterCount',char);
	let tz=java.getString('$..ActivityActionUrl',char);
	sz.push([acnm,tz,mb,sd,rs,jl,this.book.name]);}
	}
    if (kg) {
        cache.putMemory("qdzsypsz",sz);
        return [];
    }
return sz;
}


//🎟️月票界面获得显示
function looky(lyc) {
    if (!lyc) {
        let cache=this.cache;
        lyc=cache.getFromMemory("qdzsypsz");
        cache.deleteMemory("qdzsypsz");
    }
let bg='';
for (let char of lyc) {
 bg += `<br>
 <table border="1" cellspacing="0">
 <tr><th colspan="5">${char[6]}</th></tr>
 <tr style="border: none; height: 0.6em;"></tr>
 <tr><td colspan="4">${char[0]}</td>
<td rowspan="3"><a href='${char[1]}'>跳转</a></td></tr>
<tr><td>目标</td>
<td>${char[2]}张</td>
<td>收到</td>
<td>${char[3]}张</td></tr>
<tr><td>参与</td>
<td>${char[4]}人</td>
<td>奖励</td>
<td>${char[5]}</td></tr>
</table>`;}

	let htm = `<html>
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>《${this.book?.name||"月票活动"}》</title>
<style>
table {
	width: 100%;
	table-layout: fixed;
	text-align: center;
	margin: 0 auto;
	word-break: break-all;
	}
a {text-decoration: none;}
</style>
</head>
<body>
${bg}
<script>
</script>
</body></html>`;
this.java.startBrowser("https://qidian.com",'月票',htm);
}


//🌈发现排行榜选书
function phhtml() {
    let [cf,ac,bg,pr]=this.tcolor();
    let ac2 = secondColor(ac,true,10);
    let bg2=secondColor(bg,true,20);
    let bg3=secondColor(bg,true,40);
    let pr2=secondColor(pr,true,20);
    let td1 = ['玄幻', '奇幻', '武侠', '仙侠'].map(x => `<td><button>${x}</button></td>`).join('\n');
    let td2 =['都市', '现实', '历史', '军事'].map(x => `<td><button>${x}</button></td>`).join('\n');
    let td3 =['游戏', '体育', '科幻', '悬疑'].map(x => `<td><button>${x}</button></td>`).join('\n');
    let td4 = ['轻小说', '诸天无限'].map(x => `<td colspan="2"><button>${x}</button></td>`).join('\n');
    return `<html><head>
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
<title>选择分类</title>
<style>
:root {
    /* 核心颜色 - 只保留4个主色调 */
    --primary: #${pr};
    --primary-dark: #${pr2};
    --accent: #${ac};
    --accent2: #${ac2};
    
    /* 文本和背景 - 明暗模式切换 */
    --text-color: #${cf};
    --bg-color: #${bg};
    --surface-color: #${bg3};
    --border-color: #${bg2};
    
    /* 通用变量 */
    --radius: 10px;
    --radius-sm: 6px;
    --shadow: 0 4px 16px rgba(0, 0, 0, 0.2);
}

/* 亮色模式 */
@media (prefers-color-scheme: light) {
    :root {
        --shadow: 0 4px 16px rgba(0, 0, 0, 0.08);
    }
}

* {
    margin: 0;
    padding: 0;
    box-sizing: border-box;
}

html {
    background: var(--bg-color);
    color: var(--text-color);
    font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, sans-serif;
    min-height: 100vh;
    line-height: 1.5;
}

body {
    display: flex;
    flex-direction: column;
    align-items: center;
    padding: 1.5rem 1rem 3rem;
    max-width: 1200px;
    margin: 0 auto;
    min-height: 100vh;
}

h3 {
    margin: 0 0 1.5rem 0;
    font-size: 1.3rem;
    font-weight: 600;
    text-align: center;
}

h3::after {
    content: '';
    display: block;
    width: 60px;
    height: 3px;
    background: var(--primary);
    border-radius: 2px;
    margin: 0.5rem auto 0;
}

#flfl0 {
    background: var(--surface-color);
    border: 1px solid var(--border-color);
    border-radius: var(--radius);
    padding: 1.2rem;
    margin-bottom: 1.5rem;
    box-shadow: var(--shadow);
    width: 100%;
    max-width: 500px;
}

#flfl1 {
    color: var(--accent);
    font-weight: 700;
}

#flfl2 {
     color: var(--accent2);
    font-weight: 700;
}

table {
    table-layout: fixed;
    width: 100%;
    margin: 0 0 1.5rem 0;
    border-collapse: separate;
    border-spacing: 0;
    background: var(--surface-color);
    border: 1px solid var(--border-color);
    border-radius: var(--radius);
    overflow: hidden;
    box-shadow: var(--shadow);
}

td {
    text-align: center;
    padding: 0.8rem;
    border: none;
    position: relative;
}

td:not(:last-child)::after {
    content: '';
    position: absolute;
    right: 0;
    top: 25%;
    height: 50%;
    width: 1px;
    background: var(--border-color);
    opacity: 0.3;
}

tr:not(:last-child) td::before {
    content: '';
    position: absolute;
    bottom: 0;
    left: 10%;
    right: 10%;
    height: 1px;
    background: var(--border-color);
    opacity: 0.3;
}


.xz1 .title {
    background: linear-gradient(135deg, var(--primary), var(--primary-dark));
    color: var(--text-color);
    font-weight: 600;
    font-size: 1.1em;
}


.xz2 .title {
    background: transparent !important;
    color: var(--text-color);
    font-weight: 600;
    font-size: 1.1em;
}

button {
    user-select: none;
    background: linear-gradient(135deg, var(--primary), var(--primary-dark));
    color: var(--text-color);
    border: none;
    border-radius: var(--radius-sm);
    padding: 0.7rem 0.9rem;
    font-size: 0.9rem;
    font-weight: 500;
    cursor: pointer;
    transition: transform 0.2s ease, box-shadow 0.2s ease;
    width: 100%;
}

button:hover {
    transform: translateY(-1px);
    box-shadow: 0 4px 12px rgba(84, 132, 168, 0.3);
}

button:active {
    transform: translateY(0);
}


td[colspan="2"] {
    width: 10%;
}

td[colspan="4"] {
    width: 40%;
}

@media (max-width: 768px) {
    body {
        padding: 1rem 0.5rem 2rem;
    }
    
    h3 {
        font-size: 1.2rem;
        margin-bottom: 1.2rem;
    }
    
    #flfl0 {
        padding: 1rem;
        margin-bottom: 1.2rem;
    }
    
    td {
        padding: 0.6rem;
    }
    
    button {
        padding: 0.6rem 0.7rem;
        font-size: 0.85rem;
    }
}

@media (max-width: 480px) {
    body {
        padding: 0.8rem 0.4rem 1.5rem;
    }
    
    h3 {
        font-size: 1.1rem;
        margin-bottom: 1rem;
    }
    
    #flfl0 {
        padding: 0.8rem;
        margin-bottom: 1rem;
    }
    
    td {
        padding: 0.5rem;
    }
    
    button {
        padding: 0.5rem 0.6rem;
        font-size: 0.8rem;
    }
}

button:focus-visible {
    outline: 2px solid var(--primary);
    outline-offset: 2px;
}
@keyframes fadeIn {
    from {
        opacity: 0;
    }
    to {
        opacity: 1;
    }
}

table {
    animation: fadeIn 0.3s ease-out forwards;
    opacity: 0;
}

table:nth-child(1) { animation-delay: 0.05s; }
table:nth-child(2) { animation-delay: 0.1s; }
table:nth-child(3) { animation-delay: 0.15s; }
table:nth-child(4) { animation-delay: 0.2s; }
::-webkit-scrollbar {
    width: 8px;
}
::-webkit-scrollbar-track {
    background: var(--surface-color);
}
::-webkit-scrollbar-thumb {
    background: linear-gradient(135deg, var(--primary), var(--primary-dark));
    border-radius: 4px;
}
</style>
</head>
<body>
<h3 id="flfl0">当前已选择 <span id="flfl1">月票榜</span> <span id="flfl2">全部分类</span></h3>
<table class="xz1" border="1" cellspacing="0">
<tr><td colspan="4"><button>全部分类</button></td><td colspan="2" class="title">月票榜</td></tr>
<tr>${td1}<td colspan="2" rowspan="2"><button>新书月票</button></td></tr>
<tr>${td2}</tr>
<tr>${td3}<td colspan="2" rowspan="2"><button>年榜月票</button></td></tr>
<tr>${td4}</tr>
</table>
<table class="xz1" border="1" cellspacing="0">
<tr><td colspan="4"><button>全部分类</button></td><td colspan="2" class="title">畅销榜</td></tr>
<tr>${td1}<td colspan="2" rowspan="2"><button>畅销新书</button></td></tr>
<tr>${td2}</tr>
<tr>${td3}<td colspan="2" rowspan="2"></td></tr>
<tr>${td4}</tr>
</table>
<table class="xz1" border="1" cellspacing="0">
<tr><td colspan="4"><button>全部分类</button></td><td colspan="2" class="title">新书榜</td></tr>
<tr>${td1}<td colspan="2" rowspan="2"></td></tr>
<tr>${td2}</tr>
<tr>${td3}<td colspan="2" rowspan="2"></td></tr>
<tr>${td4}</tr>
</table>
<table class="xz2" border="1" cellspacing="0">
<tr><td colspan="4"><button>全部分类</button></td><td colspan="2" class="title"><button>精选榜</button></td></tr>
<tr>${td1}<td colspan="2" class="title"><button>完结榜</button></td></tr>
<tr>${td2}<td colspan="2" class="title"><button>推荐榜</button></td></tr>
<tr>${td3}<td colspan="2" class="title"><button>书友榜</button></td></tr>
<tr>${td4}<td colspan="2" class="title"><button>阅读榜</button></td></tr>
</table>
<script>
var oldtext='月票榜全部分类';

function movetager(target) {
let h3 = document.getElementById('flfl0');
let parent = target.parentElement;
parent.insertBefore(h3, target);
}

function xvanze(event) {
let txt1='',txt2='';
let button = event.target.closest('button');
let table = button?.closest('table');
let fl1=document.getElementById("flfl1");
let fl2=document.getElementById("flfl2");

if (button && table?.className == 'xz1') {
    
txt2 = button.textContent;
if (/月票|新书/.test(txt2)) {
txt1 = txt2;
txt2 = '';
} else {
txt1 = table.querySelector('.title').textContent;
}
fl1.innerHTML = txt1;
fl2.innerHTML = txt2;

} else if (button && table?.className == 'xz2') {
    
txt1 = button.textContent;

if (/榜$/.test(txt1)) {
    
fl1.innerHTML = txt1;
if (/月票|新书/.test(fl2.textContent)) {
    fl2.innerHTML = '全部分类';}

} else {
    
fl2.innerHTML = txt1;

if (/[^榜]$/.test(fl1.textContent)) {
    fl1.innerHTML = '精选榜';}
}
}

let newtext=txt1+'¤'+txt2;
if (oldtext==newtext) {
    let x2=fl2.textContent
    let res=fl1.textContent+(x2?('¤'+x2):'');
    java.open("explore",'{{\`data:page;base64,\${java.base64Encode("△,"+page+","+"'+res+'")},{"type":"lyc"}\`}}',res);
} else {
    movetager(table);
    oldtext=newtext;
   }
    
}

document.addEventListener('click', xvanze);

console.log(document.documentElement.outerHTML);
</script>
</body>
</html>`;
}




function gxjslib(){
	const {java, cache, source} = this;
	let tt=cache.get('qdzsttbb')+'';
	if (tt.length<5) {
	let rr0=java.get('https://gitee.com/lyc486/yuedu2/commits/main/书源/起点助手/jj/qdzslib.js?browser_history=0&page=1&per=1',{"User-Agent": "Mozilla/5.0 (Linux; Android 14)","X-Requested-With": "XMLHttpRequest"}).body();
	tt = com.jayway.jsonpath.JsonPath.read(rr0, '$.list[0].title')+'';
	cache.put('qdzsttbb',tt,24*60*60);}
	tt=tt.split(/^([^\-]+)-/);
	if (tt[0]!='') tt=['','0.0.0',tt[0]];
	if (tt[1]>banben2) {
		java.longToast(java.log('\n书源代码有更新\n更新内容：'+tt[2]+'\n请在登录界面点击代码更新'));}
        return tt[1];
}

function gengxin(){
const {java, source} = this;
	let url0='https://gitee.com/lyc486/yuedu2/commits/main/书源/起点助手/qdzs_特供版.json?browser_history=0&page=1&per=3';
	let rr0=java.get(url0,{"User-Agent": "Mozilla/5.0 (Linux; Android 14)","X-Requested-With": "XMLHttpRequest"}).body();
	let 	gxlrr = com.jayway.jsonpath.JsonPath.read(rr0, '$.list[0:3].title');
	let [gxlr, gxlr2, gxlr3] = gxlrr;
	let banben =   String(source.exploreUrl).match(/let banben="([\d\.]+)"/)[1];
	gxlr=String(gxlr).split(/^([^\-]+)-/);
	gxlr[0]=='' ? '' : gxlr=['','0',gxlr[0]];
	let gxts;
	if (gxlr[1]>banben){gxts=['更新','0,140,186'];}
	else {gxts= ['导入','76,175,80'];};
	let htm = `<html>
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>起点助手 ${gxts[0]}</title>
<style>
table {
	text-align: center;
	margin: 0 auto;
	}
.ann {
	display: flex;
	justify-content: center;
	align-items: center;
	height: 50vh;
	}
button {
	background-color: rgb(${gxts[1]});
	color: white;
	border: none;
	border-radius: 4px;
	height: 6vh;
	width: 30vw;
	overflow: hidden;
	}
button span {
  cursor: pointer;
  display: inline-block;
  position: relative;
  transition: 0.4s;
}
button span:after {
  content: '>';
  position: absolute;
  opacity: 0;
  top: 0;
  right: 30px;
  transition: 0.2s;
}
button:active span {
  padding-right: 20px;
}
button:active span:after {
  opacity: 1;
  right: -40px;
}
</style>
</head>
<body>
<table border="1" cellspacing="0">
<th colspan="2">最新日志：${gxlr[2]}</th>
<tr><td>仓库版本：${gxlr[1]}</td>
<td>本地版本：${banben}</td></tr>
<tr><td colspan="2" style="text-align: left;">往期日志：${gxlr2}<br>　　　　　${gxlr3}</td></tr>
</table>
<div class="ann">
<a href="legado://import/importonline?src=https://gitee.com/lyc486/yuedu2/raw/main/书源/起点助手/qdzs_特供版.json">
<button><span>${gxts[0]}</span></button>
</a>
</div>
<a href="legado://import/importonline?src=https://cdn.jsdelivr.net/gh/Luoyacheng/yuedu@main/书源/起点助手/qdzs_特供版.json" style="font-size: 10px;">备用链接</a>
</body>
</html>`;
java.startBrowser(`data:text/html;base64,${java.base64Encode(htm)}`,'助手更新');
}




//🌈段评查看
function ifjs(cid,bkid,id) {
let java=this.java;
let cache=this.cache;
if (id<-10&&id>-20) {
let url=java.base64Decode(bkid);
if (!/^qdreader:/.test(url))
url='qdreader://app/showBook?query={"bookId":'+url.match(/\d{5,}/)+'}';
java.openUrl(url);
} else {
let runjs='',title='';
if(id<-99) {
	runjs=`
	let url=QDSign("v1/chapterreview/getchapterendreview",["bookId=${bkid}","chapterId=${cid}","pg=1","pz=10"]);
	let webr=cache.getFromMemory("${bkid}${cid}bz");
	if (!webr || webr.startsWith("error") || webr.startsWith("java.")) {
	webr=java.ajax(url);
	cache.putMemory("${bkid}${cid}bz",webr);
	}	webr=com.jayway.jsonpath.JsonPath.parse(webr);
	let bzt=webr.read('$.Data.ChapterDataList[*]');
	let dpt=webr.read('$.Data.SegmentDataList[*]');
	let body=ZWjj('${bkid}','${cid}',bzt);
	for (let dpd of dpt) {
	let zw=(dpd.QuoteContent+'').replace(/^\\\\s+/,'');
	zw=\\\`<p class="zw"><svg aria-hidden="true" class="yh"><use xlink:href="#yhs"/></svg>\\\${zw}</p>\\\`;
	body+=zw;
	body+= ZWjj('${bkid}','${cid}',dpd.DataList);
	}
	body`;
	title='本章说评论';
}
else {
	runjs=`
	let url=QDSign("v2/chapterreview/getparagraphscomments",["bookId=${bkid}","chapterId=${cid}","paragraphId=${id}","pg=1","pz=20","type=0","anchorId=0","from=0"]);
	let webr=cache.getFromMemory("${bkid}${cid}${id}");
	if (!webr || webr.startsWith("error") || webr.startsWith("java.")) {
	webr=java.ajax(url);
	cache.putMemory("${bkid}${cid}${id}",webr);
	}
	let dpt = com.jayway.jsonpath.JsonPath.parse(webr).read('$.Data.DataList[*]');
	ZWjj('${bkid}','${cid}',dpt)`;
    if (id==-9) {
        cache.deleteMemory('djtp');
		java.longToast('该作家说没有回复');
		return
    }
	if (id==-10) title='作家说回复';
	else title='段评';
}
let htm = `<html><head><meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no"><meta name="color-scheme" content="light dark"><meta name="referrer" content="no-referrer"><title>${title}</title><style>
body {margin: 0 8px;}
.li {display: flex; flex-direction: row;}
.txv {position: relative; width: 15%;}
.p {position: relative; width: 75%;}
.dz {position: relative; width: 10%; display: flex; flex-direction: column; align-items: center; justify-content: center; color: #777;}
.dz::before {content: ""; display: block; margin-top: 90%;}
.tx {
position: absolute;
top: 10px;
left: 10px;
border-radius: 50%;
width: 30px;
height: 30px;
object-fit: cover;}
.txk {
position: absolute;
top: 0px;
left: 0px;
width: 50px;
height: 50px;}
.tx2 {
width: auto;
height: 2.5ex;
border-radius: 50%;
margin: 0 5px 0 0;}
.tp {
position: relative;
border-radius: 10px;
overflow: hidden;
max-width: 50%;
aspect-ratio: 1/1;}
.p1:has(>.tx2)~.tp {
max-width: 30%;}
.tp img {
width: 100%;
height: 100%;
object-fit: cover;
display: block;}
.tag {
width: auto;
height: 3ex;
margin: 0 0 0 0.5ex;}
.tag text {
font-family: Arial, sans-serif;
font-size: 18px;
fill: #FFFFFF;
text-anchor: middle;
dominant-baseline: middle;
letter-spacing: -0.5px;}
.p1 {
margin: 10px 0;
display: flex;
align-items: center;}
.p2,.p3 {
overflow-wrap: break-word;
word-break: break-all;
margin: 2px 0;}
.p1 span {
font-size: 14px;
white-space: nowrap;
overflow: hidden;
text-overflow: ellipsis;
min-width: 0;
line-height: normal;
padding-right: 1px;}
.p2 span {
color: #888;}
.p3,.dz span {
font-size: 12px;
position: relative;}
.dz span::before {
content: '';
position: absolute;
top: 50%;left: 50%;
width: 50px;height: 50px;
transform: translate(-50%, -80%);}
.p3 span {
font-size: 6px;}
.p3 {
display: flex;
align-items: center;
color: #888;}
.yh {
fill:#cbcbcb;
width:14px;
height:14px;
margin: 0 10px 0 0;}
.dzt {
width:20px; height:20px;}
#imM {
position: fixed;
top: 0; left: 0;
width: 100%;
height: 100%;
background-color: rgba(0, 0, 0, 0.9);
display: flex;
align-items: center;
justify-content: center;
z-index: 99;
opacity: 0;
visibility: hidden;
transition: all 0.4s ease;}
#imM.active {
opacity: 1;
visibility: visible;}
.modalc {
width: 100%;
height: 90%;}
.modalc img {
width: 100%;
height: 100%;
object-fit: contain;
transition: transform 0.1s ease-out;}
#lycdiv {
will-change: transform;
transform: translateZ(0);
backface-visibility: hidden;
perspective: 1000px;}
#lycdiv #jzz{
display: flex;
flex-direction: column;
justify-content: center;
align-items: center;
width: 100%; height: 100%;}
.spinner {
display: inline-block;
width: 30px;
height: 30px;
border: 3px solid rgba(255, 255, 255, 0.3);
border-radius: 50%;
border-top-color: #f85959;
animation: spin 0.6s ease-in-out infinite;
margin-top: 10px;}
@keyframes spin {
    to {
        transform: rotate(360deg);
    }
}
@keyframes q弹动画 {
0% { transform: scale(0.5); }
40% { transform: scale(0.9); }
50% { transform: scale(1.25); }
60% { transform: scale(0.95); }
75% { transform: scale(1.1); }
100% { transform: scale(1); }
}
.q弹效果 {
animation: q弹动画 0.2s ease;
}

audio {
    width: 80%;
    transform: scale(0.8);
    transform-origin: left center;
    box-sizing: border-box;
}
audio::-webkit-media-controls-overlay-enclosure,
audio::-webkit-media-controls-timeline,
audio::-webkit-media-controls-mute-button,
audio::-webkit-media-controls-toggle-closed-captions-button {
    display: none !important;
}

</style></head>
<body>
<svg xmlns="http://www.w3.org/2000/svg" style="display:none;"><symbol id="dzs" viewBox="0 0 20 20">${dztPath}</symbol><symbol id="dzsh" viewBox="0 0 24 24">${dzthPath}</symbol><symbol id="yhs" viewBox="0 0 1403 1024"><circle cx="701.5" cy="512" r="700" fill="#f5f5f5"/>${yhtPath}</symbol></svg>
<div id="lycdiv"><div id="jzz"><span>正在加载</span><div class="spinner"></div></div></div>
<div class="modal" id="imM"><div class="modalc"><img id="moI" src=""></div></div>
<script>
const lycdiv = document.getElementById('lycdiv');
const imM = document.getElementById('imM');
const moI = document.getElementById('moI');

function showModal(src) {
  java.upConfig(\`{
    "backgroundDimAmount":1
}\`);

history.pushState({lyc: "kt" },"查看图片","${qdurl+"/lookImg"}");
moI.src = src;
imM.classList.add('active');
document.body.style.overflow = 'hidden';}

function hideModal() {
    java.upConfig(\`{
    "backgroundDimAmount":0.5
}\`);

imM.classList.remove('active');
document.body.style.overflow = 'auto';
history.go(-1);}

document.addEventListener('DOMContentLoaded', function() {

window.addEventListener('popstate',function(e) {hideModal()});

imM.addEventListener('click', function(e) {
hideModal();});

});

async function init () {
const startTime = Date.now();
await new Promise((resolve, reject) => {
  const checkRun = () => {
    if (typeof window.run === 'function') resolve();
    else if (Date.now() - startTime >= 3000) reject(new Error('初始化错误'));
    else setTimeout(checkRun, 50);
   };
   checkRun();
});

try {
lycdiv.innerHTML = await window.run(\`${runjs}\`);
} catch(e) {alert("加载出错:"+e);}
document.querySelectorAll('.dz').forEach(el=>{el.addEventListener('click',function(e) {
if (e.target!=this) {
let x=this.querySelector('span');
x.textContent=+(x.textContent||0)+1;
let svg=this.querySelector('svg use');
svg.href.baseVal='#dzsh';
svg.classList.add('q弹效果');
}
});});

document.querySelectorAll('.tp').forEach(co => {
let url = co.querySelector('img').src;
co.addEventListener('click', function(e) {e.preventDefault();showModal(url);});});

};
setTimeout(init, 10);
</script>
</body>
<html>`;
java.showBrowser(qdurl, htm,"window.run=run;window.java=java;",`{
    "expandedCornersRadius":20,
    "skipCollapsed":true,
    "heightPercentage":0.9
}`);
}
}

function ftjs(x) {
const {java,source,cache}=this;
let url=java.base64Decode('aHR0cHM6Ly9naXRlZS5jb20vbHljNDg2L3l1ZWR1Mi9yYXcvbWFpbi/kuabmupAv6LW354K55Yqp5omLL2pqL21tLmpzb24');
let z,txt;
if (x>5)
z=Packages.io.legado.app.model.analyzeRule.AnalyzeRule();
if (x!=6) txt=cache.get(url);
if (!txt) {
sp(this,Math.random()*9*1e6|0);
if (cache.getFromMemory('zsyzbj')&&x!=6) {
	while(!(txt=cache.getFromMemory(url)))
	Packages.java.lang.Thread.sleep(500);
} else {
	cache.putMemory('zsyzbj',true);
	txt=java.ajax(url);
	let mk=this.gets('$.mark',txt,z);
	if (mk=='') cache.putMemory(url,txt);
	else if (mk==source.get('zsmk'))
	cache.put(url,txt,60*60*6);
	else {
	cache.put(url,txt,60*60*12);
	if (this.gets('#ag1@text',java.startBrowserAwait(this.gets('$.url',txt,z),'加载中',false).body(),z)=='已确认')
	source.put('zsmk',mk);}}
}
return x?this.gets('$.qx',txt,z):this.gets('$.mm',txt,z);
}



//🌈人气角色查看
function rqjs(bkid) {
let lku=this.QDSign("v3/bookdetail/lookfor",["bookId="+bkid,"isOutBook=0"]);
let java=this.java;
let lkr = java.ajax(lku);
let imt = com.jayway.jsonpath.JsonPath.parse(lkr).read('$..BookLookForDetail[?(@.ModelType==3)]');
let img = '';
for (let char of imt) {
  let role = char.TopRoleInfo;
  let roi = role.RoleBackGroundImage;
  let ron = role.RoleName;
  let rop = role.Position;
  let rod = role.RoleDesc;
  let rot = role.TagList;
  let rott = '';
  for (let tag of rot) {
    rott += `<div class="image-tag">${tag.TagName}</div>`;
  }
  img += `<div class="image-container" data-src="${roi}">
  <img src="${roi}" alt="${ron}">
  <div class="image-label">
  <div class="image-name">${ron}<span>${rop}</span></div>
  <div class="image-desc">${rod}</div>
  ${rott?`<div style="display: flex;flex-wrap: wrap;">${rott}</div>`: ''}
  </div>
  </div>`;
}
let htm = `<html>
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
<meta name="referrer" content="no-referrer">
<title>人气角色</title>
<style>
:root {
color-scheme: light dark;
--back-color: rgba(255, 255, 255, 0.7);
--fb-color: rgba(50, 50, 50, 0.5);
}
@media (prefers-color-scheme: dark) {
:root {
--back-color: rgba(0, 0, 0, 0.7);
--fb-color: rgba(200, 200, 200, 0.5);
}
}
.gallery {
display: flex;
flex-wrap: wrap;
justify-content: center;
gap: 25px;
margin-bottom: 40px;
}
.image-container {
position: relative;
background: rgba(255, 255, 255, 0.1);
border-radius: 12px;
overflow: hidden;
box-shadow: 0 10px 30px rgba(0, 0, 0, 0.3);
transition: all 0.3s ease;
aspect-ratio: 9/16;
}
.image-container img {
width: 100%;
height: 100%;
object-fit: cover;
display: block;
transition: transform 0.3s ease;
}
.image-label {
position: absolute;
bottom: 0;
left: 0;
right: 0;
background: var(--back-color);
padding: 12px;
}
.image-name {
text-align: left;
font-size: 28px;}
.image-name span {
font-size: 12px;
border: 1px solid #ffffff;
border-radius: 20px;
padding: 2px 4px;
margin: 6px;
}
.image-desc {
font-size: 14px;
}
.image-tag {
border-radius: 20px;
padding: 6px 10px;
margin: 5px;
background-color: var(--fb-color);
display: inline-block;
box-shadow: 0 3px 5px rgba(0,0,0,0.1);
font-size: 12px;
}
.modal {
position: fixed;
top: 0;
left: 0;
width: 100%;
height: 100%;
background-color: rgba(0, 0, 0, 1);
display: flex;
align-items: center;
justify-content: center;
z-index: 99;
opacity: 0;
visibility: hidden;
transition: all 0.1s ease;
}
.modal.active {
opacity: 1;
visibility: visible;
}
.modal-content {
max-width: 100%;
max-height: 100%;
position: relative;
border-radius: 0px;
/*overflow: hidden;*/
}
.modal-content img {
max-width: 100%;
max-height: 90vh;
display: block;
margin: 0 auto;
transition: transform 0.1s ease-out;
}
</style>
</head>
<body>
<div class="gallery">
${img}
</div>
<div class="modal" id="imageModal">
<div class="modal-content">
<img id="modalImage" src="" alt="加载异常">
</div>
</div>
<script>
window.addEventListener('popstate',function(e) {hideModal()});
const modal = document.getElementById('imageModal');
const modalImage = document.getElementById('modalImage');
const imageContainers = document.querySelectorAll('.image-container');
let imgw,imgh;
function showModal(src) {
modalImage.onload = function() {
imgw=modalImage.width;
imgh=modalImage.height;};
modalImage.src = src;
modal.classList.add('active');
document.body.style.overflow = 'hidden';
history.pushState({lyc: "kt" },"查看图片","${qdurl+"/lookImg"}");
}
function hideModal() {
modal.classList.remove('active');
document.body.style.overflow = 'auto';
applyTransform(0);
history.go(-1);
}
modal.addEventListener('click', function(e) {
if (e.target != modalImage) {//modal
hideModal();
}
});
imageContainers.forEach(container => {
const imgSrc = container.dataset.src;
container.addEventListener('click', function(e) {
e.preventDefault();
showModal(imgSrc);});
});

modalImage.addEventListener('touchstart',function(e) {
if (e.touches.length === 2) {
	e.preventDefault();
	const touch1 = e.touches[0];
 const touch2 = e.touches[1];
 lastTouchDistance = Math.hypot(
 	touch2.clientX - touch1.clientX,
 	touch2.clientY - touch1.clientY);
} else if (e.touches.length === 1 && scale > 1) {
e.preventDefault();
isDragging = true;
startX = e.touches[0].clientX - posX;
startY = e.touches[0].clientY - posY;}
});

modalImage.addEventListener('touchmove',function(e) {
if (e.touches.length === 2) {
	e.preventDefault();
	const touch1 = e.touches[0];
	const touch2 = e.touches[1];
	const currentDistance = Math.hypot(
		touch2.clientX - touch1.clientX,
		touch2.clientY - touch1.clientY);
if (lastTouchDistance > 0) {
	const newScale = scale * (currentDistance / lastTouchDistance);
	scale = Math.min(Math.max(newScale, 1), 3);
	applyTransform();
	lastTouchDistance = currentDistance;}
} else if (e.touches.length === 1 && isDragging) {
	e.preventDefault();
	posX = e.touches[0].clientX - startX;
	posY = e.touches[0].clientY - startY;
	applyTransform();}
});

modalImage.addEventListener('touchend',function() {
	lastTouchDistance = 0;
	isDragging = false;
});
let scale = 1;
let posX = 0;
let posY = 0;
let lastTouchDistance = 0;
let isDragging = false;
let startX, startY;
const innerWidth = window.innerWidth;
const innerHeight = window.innerHeight;

function applyTransform(x) {
const maxX = Math.max(0, (scale * imgw - innerWidth) * 0.5);
const maxY = Math.max(0, (scale * imgh - innerHeight) * 0.5);
posX = posX < -maxX ? -maxX : posX > maxX ? maxX : posX;
posY = posY < -maxY ? -maxY : posY > maxY ? maxY : posY;
if (x==0) {scale=1;posX=posY=0;}
	modalImage.style.transform = \`translate(\${posX}px, \${posY}px) scale(\${scale})\`;
}

</script>
</body>
<html>`;
if (img)
java.startBrowser(qdurl, '人气角色',htm);
else java.longToast('\n没有角色信息');
}


dpt=(n,c)=>`<svg viewBox="5 14 45 36" width="180" height="144"><path d="M44 48 Q48 48 48 44 L48 20 Q48 16 44 16 L20 16 Q16 16 16 20 L16 24 S16 28 10 30 Q6 32 10 34 Q16 36 16 38 L16 44 Q16 48 20 48 Z" stroke="#${c}" opacity="0.8" stroke-width="0.7" fill="none" ></path><text x="32" y="38" font-size="18" fill="#${c}" opacity="0.8" text-anchor="middle" dominant-baseline="middle" font-weight="bold">${n}</text></svg>`;




//🌈本章说和界面图片
function zwzs(bkid,zcid,lyc='') {
	const {java, source, cache} = this;
let qx=java.md5Encode(source.getVariable())==this.jiesuo('','');
let [cf,ac,bg]=this.color(true);
function rect(y) {
    if (bg == null) return '';
   return `<rect x="0" y="0" width="1080" height="${y}" rx="20" ry="20" fill="#${bg}" fill-opacity="0.7" />`;
}

if (lyc) {
let [auim,aude,atw,bks,lx,zs,zsz,zz,sj,tag,bkurl]=lyc;
let svg1=`<svg width="1080" height="240" xmlns="http://www.w3.org/2000/svg">
<text fill="#${cf}" text-anchor="middle" dominant-baseline="middle" font-weight="bold" font-size="60">
<tspan x="15%" y="40%">${lx}</tspan>
<tspan x="50%" y="40%">${sj}</tspan>
<tspan x="85%" y="40%">${zs}</tspan>
</text>
<text fill="#${cf}" opacity="0.6" text-anchor="middle" dominant-baseline="middle" font-weight="bold" font-size="40">
<tspan x="15%" y="70%">类型</tspan>
<tspan x="50%" y="70%">上架</tspan>
<tspan x="85%" y="70%">${zsz}/${bks}</tspan>
</text>
</svg>`;
let lg=atw.length,tgd=240;
if (lg<17) {atw=`<tspan x="10%" dy="80">${atw}</tspan>`;}
else {atw=`<tspan x="10%" dy="80">${atw.slice(0,16)}</tspan><tspan x="10%" dy="80">${atw.slice(16)}</tspan>`;tgd=360;}
let svg2=`<svg width="1080" height="${tgd}" xmlns="http://www.w3.org/2000/svg">
<text fill="#${cf}" opacity="0.2" text-anchor="middle" dominant-baseline="middle" font-weight="bold" font-size="30">
<tspan x="50%" y="10%">${"~".repeat(46)}</tspan>
</text>
<text fill="#${cf}"  dominant-baseline="middle" font-weight="bold" font-size="50">
<tspan x="50%" y="12%">${atw}</tspan>
<tspan x="90%" y="80%" text-anchor="end">— ${zz}</tspan>
</text>
<text fill="#${cf}" opacity="0.2" text-anchor="middle" dominant-baseline="middle" font-weight="bold" font-size="30">
<tspan x="50%" y="100%">${"~".repeat(46)}</tspan>
</text>
</svg>`;
let svg3=`<svg width="1080" height="180" xmlns="http://www.w3.org/2000/svg">
<text fill="#${cf}" opacity="0.6" text-anchor="middle" dominant-baseline="middle" font-weight="bold" font-size="40">
<tspan x="50%" y="50%">— 本作品由起点中文网进行电子制作与发行 —</tspan>
<tspan x="50%" y="80%">版权所有·侵权必究</tspan>
</text>
</svg>`;
let img=(x,y)=>{return `	<img src="data:image/svg+xml;base64,${java.base64Encode(x)},{"click":"ifjs(\`${zcid}\`,\`${bkurl}\`,${y});","type":"img","style":"full"}">`;};
let imgg=(x,y)=>{return `<img src="data:image/svg+xml;base64,${java.base64Encode(x)},{"style":"full"}">`;};
let img1=img(svg1,-11),
img2=img(svg2,-12),
img3=qx?imgg(svg3,-13):'';
return `${img1}
${img2}
${auim!=''?'<img src="'+auim+',{"style":"right"}">':''}
<usehtml>　　${aude}</usehtml>
<usehtml><small>${tag}</small></usehtml>
${img3}`;}
if (!qx) return '';
		let url6 = this.QDSign("v1/assembly/getchapteractivity",["bookId="+bkid,"chapterId="+zcid],(lyc+''));
	let bzs=java.ajax(url6);
	let bzt = com.jayway.jsonpath.JsonPath.parse(bzs);
	let pls=bzt.read('$.Data.Getchapterendcomments.TotalCount');
	let zjs=bzt.read('$.Data.Getchapteractivity');
	let zj=zjs.AuthorName;
	let zjt=zjs.AuthorComments;
	let zjr=zjs.RecList;
	let imjs=x=>{return `ifjs(\`${zcid}\`,\`${bkid}\`,${x});`};
	let img6='';
	if (zjt!=''&&zjr=='[]') {
		let hs=1;
		let zjsdp=java.get('zjsdp');
		let imt=`<text fill="#${cf}" opacity="0.9"  dominant-baseline="middle" font-weight="bold" font-size="50"><tspan x="4%" y="${hs*60}">作家说</tspan>${zjsdp>0?('<tspan x="96%" y="'+hs*60+'" text-anchor="end">'+zjsdp+'条回复 ❯</tspan>'):''}</text>`;
hs++;
zjt = this.QDSign("v2/assembly/getchapterreveiwcount",["bookId="+bkid,"chapterId="+zcid],(zjt+''));
imt+=`<text fill="#${cf}" opacity="0.9"  dominant-baseline="middle" font-weight="bold" xml:space="preserve" font-size="48">`;
for (let fd of zjt) {
	imt+=`<tspan x="4%" y="${hs*60+30}">${fd}</tspan>`;
	hs++;}
hs=hs+0.5;
imt+=`</text><text fill="#${cf}" opacity="0.9"  dominant-baseline="middle" font-weight="bold" xml:space="preserve" font-size="50"><tspan x="96%" y="${hs*60}" text-anchor="end">—— ${zj}</tspan></text>`;
hs++;
	let svg6= `<svg width="1080" height="${hs*60}" xmlns="http://www.w3.org/2000/svg">
${rect(hs*60)}
${imt}</svg>`;
img6=`
<img src="data:image/svg+xml;base64,${java.base64Encode(svg6)},{"click":"${zjsdp>0?imjs(-10):imjs(-9)}","type":"img","style":"full"}">`;
		}
	if (pls<1) return img6;
	bzt=bzt.read('$..DataList[*]');
	let img4='';
	let ij=0;
    let fhs=0,fsv="";
	for (let char of bzt) {
		ij++;
        let hs=1;
        if (ij==2 && fhs<5) { //第一个少，第二个也合并
            hs+=fhs;
        }
		let fy=(char.Content+'').replace(/\[fn=(\d+)\]/g,(x,y)=>{return emojisMap[y]});
		let nm=char.UserName;
		let dz=char.AgreeAmount;
		let imt=`<text fill="#${cf}" opacity="0.9"  dominant-baseline="middle" font-weight="bold" font-size="50"><tspan x="4%" y="${hs*60}">${nm}</tspan><tspan x="96%" y="${hs*60}" text-anchor="end">${dz}</tspan></text><g transform="translate(${960-20*(dz+'').length},${hs*60-50})  scale(3)">${dztPath.replaceAll('#808080','#'+cf)}</g>`;
		hs++;
fy = this.QDSign("v2/assembly/getchapterreveiwcount",["bookId="+bkid,"chapterId="+zcid],(fy+''));
for (let fd of fy) {
	imt+=`<text fill="#${cf}" opacity="0.9"  dominant-baseline="middle" font-weight="bold" font-size="48"><tspan x="4%" y="${hs*60+30}">${fd}</tspan></text>`;
	hs++;}
    if (ij ==1) {
        fhs=hs;
        fsv=imt;
        continue; //第一个需要合并
    }
    if (ij==2 && fhs<5) { //第二个也合并
         fhs=hs;
        fsv+=imt;
        continue;
    }
let svg4= `<svg width="1080" height="${hs*60}" xmlns="http://www.w3.org/2000/svg">
${rect(hs*60)}
${imt}</svg>`;
img4+=`
<img src="data:image/svg+xml;base64,${java.base64Encode(svg4)},{"clik":"${imjs(-100)}","type":"img","style":"full"}">`;
}
if (fsv) {
    fsv = `<g transform="translate(0,80)"> ${fsv}</g>`;
}
let svg5= `<svg width="1080" height="${80+fhs*60}" xmlns="http://www.w3.org/2000/svg">
${rect(80+fhs*60)}
<text fill="#${cf}" opacity="0.9" dominant-baseline="middle" font-weight="bold" font-size="48">
<tspan x="4%" y="60">本章说</tspan>
<tspan x="96%" y="60" text-anchor="end">${pls}条评论 ❯</tspan>
</text>
${fsv}
</svg>`;
let img5=`
<img src="data:image/svg+xml;base64,${java.base64Encode(svg5)},{"click": "${imjs(-100)}","type":"img","style":"full"}">`;
return img6+img5+img4;
}



//🌈段评相关
function dpcl(dprr, res, tpdp) {
	let java = this.java;
	dprr = com.jayway.jsonpath.JsonPath.parse(dprr);
	let dp = dprr.read('$.data.list[*]');
    let [tc, ac]=this.color();
	for (let char of dp) {
		let id = char.paragraphId;
		let count = char.textCount;
		if (count > 999) count = 999;
		let hot = +char.isHotComment;
        let color = hot == 1? ac : tc;
		if (id == -10) {
            java.put('zjsdp',count);
            this.chapter.putLyric("");}
		else if (id == -1) {
            this.chapter.putImgUrl(`http:${count+id},{"js":"dpurl(${count},'${color}')","click":"dpshow(${id})","type":"i",style:"text"}`);
		} else if (id > 0) {
            let svgstr = `<img src="http:${count+id},{"style":"TEXT","js":"dpurl(${count},'${color}')","click":"dpshow(${id})","type":"i"}">`;
            if (id > 99999) {
                let intt = tpdp[id];
                if (intt != null) {
                    res[intt] = res[intt].replace('>','>'+svgstr);
                }
            }
            else {res[id - 1] += svgstr;}
		}
	}
	return res;
}

function dpshow(id) {
    let [, zcid] = this.chapter.url.match(/^[^\,]+,([^\,]+)/);
	zcid = this.java.base64Decode(zcid);
	this.ifjs(zcid,this.book.getVariable("bkid"),id)
}

function dpurl(count, color) {
	return `data:image/svg+xml;base64,${this.java.base64Encode(dpt(count, color))}`;	
}



//🌈按钮回调操作
function dbkid(x) {
    const {java, source, book} = this;
    try {
        if (!book) throw '请在书籍界面点击';
        var bkid = book.getVariable("bkid");
        var bj = book.getVariable("bj");
        if (bkid.length() < 3) throw '未正常获取id';
        if (x == 0) {
            if (this.isLongClick) {
             java.copyText(bkid);
            java.toast('已复制《' + book.name + '》id号');
            return
            }
            java.copyText(book.name);
            java.toast('已复制书名《' + book.name + '》');
            return
        }
        if (x == 1)
            java.openUrl('qdreader://app/showBook?query={"bookId":' + bkid + '}');
        else if (x == 2&&bj !='评')
            this.rqjs(bkid);
        else if (x == 3) {
            if (bj =='评') {
                java.toast('应该是误触吧？\n没必要点击这里');
                return 1;
            }
            let au = (book.author+'').replace('\u200b', '');
            source.put("qdzskzz",au);
            java.open("explore",'{{`data:page;base64,${java.base64Encode("作,"+page)},{"type":"lyc"}` }}',au);
        } else if (x == 4) {
            if ( bj == '评') {
                 source.put("qdzsdsp",bkid);
                java.open("explore",'{{`data:page;base64,${java.base64Encode("单,"+page)},{"type":"lyc"}` }}',book.name);
                Packages.java.lang.Thread.sleep(100);
                java.toast('\n已经是评论了，为你加载该书单');
                return
            }
            source.put("qdzsdsp",bkid);
            java.open("explore",'{{`data:page;base64,${java.base64Encode("评,"+page)},{"type":"lyc"}` }}',book.name);
        }
        else if (x == 5) {
            java.copyText(`《${book.name}》作者：${book.author.replace('\u200b', '')}
链接：https://m.qidian.com/book/${bkid}/`);
            java.longToast('已复制到剪贴板');
        }
        else if (x == 6) {
            if ( bj == '评') {
                source.put("qdzsdsp",bkid);
                java.open("explore",'{{`data:page;base64,${java.base64Encode("单,"+page)},{"type":"lyc"}` }}',book.name);
                return 1
            }
            return 0
        }
    } catch (err) {
        java.toast(err);
        return 0
    }
}



//🌈辅助类函数
function connectb(url) { //网络访问
return Packages.io.legado.app.model.analyzeRule.AnalyzeUrl(url).getByteArray();
}

function color(gbg=false) { //得到阅读配色
    let java = this.java;
    let md = java.getThemeMode();
    let rdc = java.getReadBookConfigMap();
    if (md == 3) {
         let tc = rdc["textColorEInk"].slice(-6);
        let ac = rdc["textAccentColorEInk"].slice(-6);
        if (gbg) {
            let bg = rdc["bgStrEInk"];
            return [tc, ac, secondColor(bg)];
        }
        return [tc, ac];
    }
    if (md == 0) {
        let isN=java.getThemeConfigMap()["isNightTheme"];
        md = isN==true?2:1;
    }
    if (md == 1) {
         let tc = rdc["textColor"].slice(-6);
        let ac = rdc["textAccentColor"].slice(-6);
        if (gbg) {
            let bg = rdc["bgStr"];
            return [tc, ac, secondColor(bg)];
        }
        return [tc, ac];
    }
    if (md == 2) {
         let tc = rdc["textColorNight"].slice(-6);
        let ac = rdc["textAccentColorNight"].slice(-6);
        if (gbg) {
            let bg = rdc["bgStrNight"];
            return [tc, ac, secondColor(bg)];
        }
        return [tc, ac];
    }
}

function tcolor() { //得到主题配色
    let tc = this.java.getThemeConfigMap();
    let isN=tc["isNightTheme"];
    let cf = isN==true? "EFEFEF":"101010";
    let ac = tc["accentColor"].slice(-6);
    let bg= tc["backgroundColor"].slice(-6);
    let pr=tc["primaryColor"].slice(-6);
    return [cf, ac,bg,pr];
}

function darkenColor(hex, amount = 100) {
  const bigint = parseInt(hex, 16);
  let r = (bigint >> 16) & 255;
  let g = (bigint >> 8) & 255;
  let b = bigint & 255;
  r = Math.max(0, r - amount);
  g = Math.max(0, g - amount);
  b = Math.max(0, b - amount);
  return ((r << 16) + (g << 8) + b).toString(16).padStart(6, '0');
}

function secondColor(hex,fi,ment = 40) { //第二颜色，亮色暗，暗色亮
    if (!fi&&!hex.startsWith('#')) return null;
    const r = parseInt(hex.slice(-6,-4), 16);
    const g = parseInt(hex.slice(-4,-2), 16);
    const b = parseInt(hex.slice(-2), 16);
    const brightness = (r * 299 + g * 587 + b * 114) / 1000;
    let nr, ng, nb;
    if (brightness > 128) {
        nr = Math.max(0, r - ment);
        ng = Math.max(0, g - ment);
        nb = Math.max(0, b - ment);
    } else {
        nr = Math.min(255, r + ment);
        ng = Math.min(255, g + ment);
        nb = Math.min(255, b + ment);
    }
    return ((1 << 24) + (nr << 16) + (ng << 8) + nb).toString(16).slice(1);
}

function gethd(url,ck='',ua='') {
let u_am=this.java.getWebViewUA().replaceAll("; wv| Version\/4.0",'');
let domain=(url+'').match(/^http.{4}[^\/]+./)[0];
	let headerss = {
		  "User-Agent": u_am,
		  "sec-ch-ua": s_c_ua,
    	 "sec-ch-ua-mobile": s_c_ua_m,
     	"sec-ch-ua-platform": s_c_ua_p,
     	"Cache-Control": cache_c,
     	"Accept-Language": a_l,
     	"Sec-Fetch-Site": "none",
     	"Sec-Fetch-Mode": "navigate",
     	"Sec-Fetch-Dest": "document",
     	"Referer": domain
    	 }
if (/\.js$/.test(url)) {headerss["Sec-Fetch-Dest"]="script";}
else if (/\.(?:png|jpe?g|webp|gif)$/i.test(url)) {headerss["Sec-Fetch-Dest"]="image";
headerss["Sec-Fetch-Site"]="same-origin";
headerss["Sec-Fetch-Site"]="no-cors";}
if (/www.libahao/.test(url)) {
headerss["User-Agent"]=u_ap;
headerss["sec-ch-ua-mobile"]=s_c_ua_mp;
headerss["sec-ch-ua-platform"]=s_c_ua_pp;
}
if (ck=='1') return url + ',' + JSON.stringify({"headers":headerss,"webView":true});
if (ck!='') headerss["Cookie"]=ck;
if (ua!='') headerss["User-Agent"]=ua;
return url + ',' + JSON.stringify({"headers":headerss});
};

var sp=(x,y)=>Packages.java.util.concurrent.locks.LockSupport.parkNanos(x,y);



//🌈常量
const dztPath=`<path d="M8.74999 1.66699C8.43435 1.66699 8.14579 1.84533 8.00463 2.12765C7.84178 2.45336 7.74456 2.91228 7.66084 3.31295C7.64604 3.38376 7.63112 3.45605 7.61588 3.52984C7.5347 3.92296 7.44465 4.35908 7.31865 4.84207C7.08137 5.75168 6.72257 6.80035 6.09535 7.87401C5.9253 8.1651 5.60793 8.33334 5.27081 8.33342L4.99975 8.33348C3.61915 8.33363 2.50003 9.45287 2.50003 10.8335L2.5 14.9997C2.49999 16.3805 3.61928 17.4998 5 17.4998H6.21903C6.22936 17.5001 6.23972 17.5003 6.25009 17.5003L13.9618 17.5003C15.212 17.5003 16.27 16.5768 16.4389 15.3381L17.2344 10.3381C17.4391 8.83703 16.2723 7.50033 14.7573 7.50033H12.5V5.41699C12.5 3.96187 11.9992 2.95333 11.164 2.34684C10.3796 1.77734 9.43844 1.66699 8.74999 1.66699ZM9.29227 3.65384C9.3139 3.55032 9.33363 3.45901 9.35173 3.37858C9.67046 3.43048 9.9576 3.53059 10.1847 3.69548C10.4971 3.92232 10.8333 4.37212 10.8333 5.41699V8.33366C10.8333 8.7939 11.2064 9.16699 11.6667 9.16699H14.7573C15.2623 9.16699 15.6512 9.61256 15.583 10.1129L14.7875 15.1129C14.7312 15.5258 14.3786 15.8337 13.9618 15.8337L7.08343 15.8337V9.42884C8.09998 7.93645 8.61855 6.46187 8.93135 5.26275C9.06916 4.73449 9.1687 4.25197 9.2498 3.85889C9.26452 3.7875 9.27864 3.71907 9.29227 3.65384ZM4.99994 10.0001L5.41672 10L5.41666 15.8331H5C4.53976 15.8331 4.16666 15.46 4.16667 14.9998L4.16669 10.8335C4.1667 10.3733 4.53974 10.0002 4.99994 10.0001Z" fill="#808080"/>`;
const dzthPath=`<path d="M9.60557 2.55279C9.77496 2.214 10.1212 2 10.5 2C11.3261 2 12.4556 2.13242 13.3968 2.81582C14.3991 3.54361 15 4.75385 15 6.5V9H17.7088C19.5267 9 20.9269 10.6041 20.6813 12.4053L19.7267 18.4053C19.524 19.8918 18.2544 21 16.7542 21L7.50012 21C7.48767 21 7.47524 20.9998 7.46285 20.9993H6C4.34314 20.9993 2.99999 19.6562 3 17.9993L3.00003 12.9998C3.00004 11.343 4.34298 9.99996 5.99971 9.99978L6.32498 9.99971C6.72953 9.99962 7.11037 9.79774 7.31443 9.44843C8.06709 8.16003 8.49766 6.90162 8.7824 5.81009C8.93359 5.2305 9.0956 4.4469 9.19302 3.97515C9.21129 3.88666 9.17528 4.06006 9.19302 3.97515C9.29348 3.49435 9.41015 2.94364 9.60557 2.55279ZM5.99992 11.9998C5.44768 11.9998 5.00004 12.4475 5.00003 12.9998L5 17.9993C5 18.5516 5.44771 18.9993 6 18.9993H6.5L6.50006 11.9996L5.99992 11.9998Z" fill="#F85959"/>`;
const yhtPath=`<path d="M1134.557 812.998c17.527-19.084 31.464-41.616 41.748-67.523 10.292-25.97 15.44-52.296 15.44-78.972 0-54.934-15.465-101.661-46.389-140.206-30.928-38.536-71.185-61.576-120.846-69.209l-17.206-1.117-14.898-2.332c-22.884-3.043-34.344-11.842-34.344-26.325 0-15.263 15.301-39.308 45.845-72.087 32.092-35.123 82.902-70.576 152.395-106.423 29.047-15.242 43.567-34.35 43.567-57.227 0-14.506-4.958-26.528-14.864-36.075-9.904-9.523-22.509-14.291-37.778-14.291-38.137 0-90.775 22.151-157.898 66.381-79.314 51.904-142.614 114.997-189.922 189.402-47.308 74.41-70.961 147.803-70.961 220.309 0 34.324 6.505 68.447 19.463 102.432 12.945 33.918 30.505 62.704 52.609 86.399 46.535 51.1 102.585 76.653 168.144 76.653 67.111 0 122.432-23.268 165.891-69.79v0zM588.050 812.998c17.53-19.084 31.398-41.796 41.685-68.106 10.296-26.367 15.405-52.46 15.405-78.39 0-54.934-15.22-101.849-45.636-140.777-30.412-38.918-70.357-61.778-119.82-68.639l-18.254-1.117-13.706-2.332c-22.797-3.043-34.235-11.842-34.235-26.325 0-15.263 14.861-39.308 44.539-72.088 31.215-33.574 81.826-69.067 151.835-106.422 28.96-15.242 43.4-34.35 43.4-57.227 0-14.506-4.913-26.527-14.825-36.075-9.907-9.524-22.485-14.291-37.722-14.291-38.036 0-90.578 22.151-157.603 66.381-79.179 51.902-142.174 114.997-189.006 189.402-46.794 74.408-70.232 147.803-70.232 220.309 0 34.324 6.47 68.447 19.43 102.432 12.958 33.918 30.442 62.704 52.516 86.399 46.415 51.1 101.985 76.653 166.685 76.653 67.754 0 122.938-23.268 165.541-69.79v0z" p-id="8641"></path>`;
const emojisMap = {"31":"😳", "21":"😍", "11":"🙄", "32":"😎", "12":"😭", "43":"☺️", "50":"🤐", "45":"😴", "19":"😂", "37":"😡", "47":"😱", "26":"🤪", "4":"😁", "40":"😞", "36":"🤓", "17":"😓", "24":"😫", "51":"🥴", "33":"🤭", "7":"🙂", "49":"😪", "16":"🥵", "14":"😥", "5":"😄", "46":" 🤠🚬 ", "29":"💪", "44":"🤬", "39":" 😄❓ ", "18":"🤫", "13":"😵", "28":"😣", "20":"😢", "30":"💀", "22":" 🤕🔨 ", "34":" 😄👏 ", "10":" 👆🏻🐽 ", "1":"👏", "23":"😑", "8":"😏", "41":"😧", "15":"🖕🏻", "38":"🙁", "58":"😒", "9":"😙", "60":"😮", "6":"🥺", "54":"🔪", "48":"🐷", "2":"🌹", "42":"💋", "53":"❤️", "56":"💔", "52":"🌙", "55":"🎁", "25":"🤗", "35":"👍🏻", "3":"🤝", "59":"✌🏻️", "27":"🙏", "57":"👊🏻", "61":"🤨", "62":"😴", "63":"👏🏻", "64":"🐲"};
const duiz1 = {
    月票榜: "0",
    畅销榜: "65",
    新书榜: "99001",
    精选榜: "100039",
    完结榜: "90001",
    推荐榜: "3",
    书友榜: "2081",
    阅读榜: "100014",
    新书月票: "60001",
    畅销新书: "965"
};
const duiz2 = {
    全部分类: "-1",
    玄幻: "21",
    奇幻: "1",
    武侠: "2",
    仙侠: "22",
    都市: "4",
    现实: "15",
    历史: "5",
    军事: "6",
    游戏: "7",
    体育: "8",
    科幻: "9",
    悬疑: "10",
    轻小说: "12",
    诸天无限: "20109"
};